{"case_id": "d8d00cedc4ed5c7e", "topic_url": "https://wpml.org/forums/topic/jetengine-meta-fields-not-displaying/", "text": "JetEngine Meta Fields Not Displaying If you're experiencing issues with translating Custom Post Types (CPT) and their associated meta fields using JetEngine and WPML, where the meta fields do not appear as editable options within the translation screen, follow the steps below.", "solution": "1. Confirm that you have set your translation preferences correctly by navigating to WPML → Settings. Ensure you have the following sections configured: - Post Types Translation – Set Listings, Components, Post Types, etc., to Translatable. - Custom Fields Translation – Set Meta Boxes, Meta Fields, etc., to Translate. If the fields handle settings that do not need a translation, set them to \"Copy\". - Taxonomies Translation – Set Custom Taxonomies, etc., to Translatable. Save these settings. 2. Edit one of the original post types, save it, and then open the translation editor. You should now see the metafields in the Advanced Translation Editor. For detailed guidance, visit How to Translate JetEngine with WPML . 3. If the metafields are still not translatable, go to WPML > Settings > Custom Field Translation and set each related field to \"Translate\". After setting, edit and save one of the affected original posts, then update the translation. For more information, check Translating Custom Fields . 4. If issues persist, we recommend backing up your website and providing temporary admin access for further investigation."}
{"case_id": "efbc10e19184244b", "topic_url": "https://wpml.org/forums/topic/elementor-text-editor-widget-links-not-updating/#post-17642705", "text": "You are trying to have text editor widget links automatically update to the correct language path during page duplication, but the URL paths are not updating as expected. Instead of showing the en-au version, the links are defaulting to the English version.", "solution": "We recommend converting the duplicated page into a translation to ensure that the links update to the correct language path. You can find detailed instructions on how to do this in our documentation: Convert a Duplicate Into a Translation ."}
{"case_id": "28a6819a7420792a", "topic_url": "https://wpml.org/forums/topic/wpml-setup-stuck-on-step-4-ai-translation-loading/", "text": "WPML setup stuck on step 4 AI Translation loading If you're experiencing an issue where the WPML setup gets stuck at step 4 (AI translation) and you see a blank screen with a spinner that quickly disappears, the problem might be related to the naming of the WPML plugin folder.", "solution": "We recommend checking the name of the WPML plugin folder in your plugins directory. It should be named sitepress-multilingual-cms . If it is incorrectly named (e.g., sitepress-multilingual-cms 2 ), rename it back to sitepress-multilingual-cms . This should resolve the setup issue and allow you to proceed with the wizard."}
{"case_id": "89d7699564629755", "topic_url": "https://wpml.org/forums/topic/why-did-wpml-wordpress-plugin-write-a-string-instead-of-an-array-in-one-of-the-wp_options-rows-caus/", "text": "Why did WPML WordPress plugin write a string instead of an array in one of the wp_options rows, caus... You are experiencing a fatal error on your website after the WPML plugin wrote a string instead of an array in one of the wp_options rows, causing the website to go down.", "solution": "First, we need more details about the issue to assist you effectively. Please identify where exactly you see this error and the full content of the error message. Follow the instructions provided in the link to retrieve the debug information from your site and share it with us. Here is the link to guide you on how to provide the necessary information: http://wpml.org/faq/provide-debug-information-faster-support/ Please note that the solution provided might be irrelevant if it's outdated or not applicable to your case."}
{"case_id": "ada13192ec2f4aa4", "topic_url": "https://wpml.org/forums/topic/template-menu-and-footer-betheme/", "text": "Template menu and footer betheme The client is experiencing issues with the menu and footers not displaying correctly in translation on a Betheme template, despite updating the code in the theme's functions.php file.", "solution": "We recommend verifying and increasing the WordPress Memory Limit as it is currently set below the recommended minimum, which can affect the display of translated strings. Here are the steps to follow: 1. Go to WPML → Support and check the current memory limit. 2. If it's below 128MB, increase it to at least 128MB (256MB is preferable for optimal performance). 3. After adjusting the memory limit, re-process the strings to see if the issue with the menu and footers is resolved."}
{"case_id": "efa43882cb666685", "topic_url": "https://wpml.org/forums/topic/products-in-second-language-dont-have-default-variation-selected-2/", "text": "Products in second language don’t have default variation selected The client is experiencing an issue where products in a second language do not have a default variation selected, despite updating WPML WooCommerce Multilingual to version 5.5.2.3.", "solution": "We recommend the following steps to resolve the issue: 1. Increase the WordPress memory limit to at least 256MB by adding define('WP_MEMORY_LIMIT', '256M'); in the 'wp-config.php' file. 2. Resave the original product in the default language by making a minor edit and updating it. 3. Check and update the product translation if necessary. 4. Use the troubleshooting tools in WooCommerce Multilingual & Multicurrency to synchronize product variations and fix language connections. 5. Clear all caches on the site, including any caching plugins, server-side caches, and browser cache. 6. If the issue persists, manually check that all attributes and global variations are fully translated and linked. Also, ensure each variation in the translated product has its price and attributes set correctly. 7. Avoid repeating basic steps already completed and clear all caches again after adjustments. 8. If problems continue, consider potential theme or plugin overrides or JavaScript issues that might interfere with variation display on translated products. If these steps do not resolve the issue or if the solution seems outdated or irrelevant to your case,"}
{"case_id": "6284933c0a3e5bfa", "topic_url": "https://wpml.org/forums/topic/elementor-global-form-not-showing-translation/?paged=2#post-17615735", "text": "You are trying to display a translated global form using WPML on your Elementor site, but the form appears in the original English instead of the expected translation.", "solution": "This issue has been reported to Elementor and will be fixed in a future update of the plugin. In the meantime, we recommend adding the following code to your theme's functions.php file to ensure the Elementor global form is translated correctly. Please ensure you have a full backup of your site before proceeding. // === WPML not translating contact forms FIX === if ( ! is_admin() ) { add_filter( 'get_post_metadata', 'wpmlpb_735_translate_elementor_data', 10, 4 ); } function wpmlpb_735_translate_elementor_data( $value, $object_id, $meta_key, $single ) { // Only act on Elementor data if ( '_elementor_data' !== $meta_key ) { return $value; } // Temporarily remove this filter to avoid infinite recursion remove_filter( 'get_post_metadata', 'wpmlpb_735_translate_elementor_data', 10 ); // Get the actual Elementor data $elementor_data = get_post_meta( $object_id, '_elementor_data', $single ); // Re-add the filter add_filter( 'get_post_metadata', 'wpmlpb_735_translate_elementor_data', 10, 4 ); // Process and convert dynamic elements if possible if ( is_string( $elementor_data ) && ! empty( $elementor_data ) ) { $data_array = json_decode( $elementor_data, true ); if ( is_array( $data_array ) && class_exists( '\\WPML\\PB\\Elementor\\Hooks\\DynamicElements' ) ) { $dynamic_elements = new \\WPML\\PB\\Elementor\\Hooks\\DynamicElements(); $data_array = $dynamic_elements->convert( $data_array ); return json_encode( $data_array ); } } return $elementor_data; } Test this solution on a staging site first. If you encounter any issues or need further assistance, please do not hesitate to contact us . Additionally,"}
{"case_id": "b535d3cda49ae3a4", "topic_url": "https://wpml.org/forums/topic/split-translate-the-footer-complete/#post-17636135", "text": "If you're experiencing difficulties with translating the complete footer in your website,", "solution": "We recommend that you first navigate to WPML → String Translation and search for the strings that still need translation. If you do not find them there, you should check the Admin Texts Translation section. For detailed guidance, please visit https://wpml.org/forums/topic/split-set-a-different-logo/ . If the issue persists, please inform us about how the footer was created (whether through a theme builder, Elementor, WPBakery, widgets, or a custom template). This information will help us determine where the strings are stored and how they should be translated."}
{"case_id": "296b358bf2156135", "topic_url": "https://wpml.org/forums/topic/auto-translate-seemingly-stuck-for-one-page/?paged=2", "text": "2 The client was experiencing issues with WPML's PTC auto translation for a specific page on their website. The auto translation process was stuck, and manual translation attempts were also failing. The translation status icon would rotate for a long time and then change to a gear icon, indicating 'waiting for the first available partner'.", "solution": "We investigated the issue and found that it was not related to PTC. After testing the page on a sandbox environment and on the client's site with different settings, the translation worked correctly. It appears the problem might have been caused by server or connection issues, or a temporary issue on our external server where the Advanced Translation Editor (ATE) runs. We also advised the client to check the WPML settings for generating slugs from page titles and to remove any duplicated pages to adjust the slug correctly. If you're experiencing similar issues, we recommend checking your server and connection settings, ensuring there are no duplicated pages, and verifying your WPML slug settings under WPML > Languages ​​> Options for translated documents > Page URL > Automatically generate from title (default) . If the problem persists, it might be a temporary issue on our end, and we recommend contacting us for further assistance."}
{"case_id": "415e3746199fb3ca", "topic_url": "https://wpml.org/forums/topic/wpml-not-compatible-with-litespeed-quic-service/?paged=1", "text": "1 The client is experiencing an issue where attempting to validate the Litespeed extension with QUIC.cloud results in a 404 error page when WPML is activated. This problem persists even after resaving permalinks with WPML deactivated, indicating a potential redirect issue caused by WPML.", "solution": "We recommend the following steps to troubleshoot and potentially resolve the issue: 1. Deactivate WPML and connect to the Litespeed Cloud. If successful, reactivate WPML and check if the issue reoccurs. 2. If the problem persists, create a sandbox site with a fresh WordPress, WPML, and Litespeed installation to verify if the issue is specific to the client's current site setup. 3. Consult with the hosting providers to check for any server-side configurations, firewall rules, or security directives that might be causing the redirect issue. Additionally, reviewing server logs may provide further insights into the problem. If these steps do not resolve the issue or if the solution seems outdated or irrelevant to your case,"}
{"case_id": "846b936443138f18", "topic_url": "https://wpml.org/forums/topic/spanish-product-urls-changed-and-now-show-404/", "text": "Spanish product URLs changed and now show 404 The client is experiencing 404 errors on Spanish product URLs which were expected to use the same English slugs. The client wants to keep product slugs in default English and prevent titles/descriptions from being translated.", "solution": "1. Backup Your Website : Always create a full backup before making significant changes. 2. Configure Product Post Type Translation : This ensures separate Spanish versions of products, even if some elements like titles and slugs are copied from English. Go to WPML → Settings in your WordPress dashboard. Scroll down to the Post Types Translation section. Locate Products (product) and ensure it is set to 'Translatable - use translation if available or fallback to default language'. If the solution provided here does not resolve your issue or seems outdated, we recommend checking related known issues at https://wpml.org/known-issues/ , verifying the version of the permanent fix, and confirming that you have installed the latest versions of themes and plugins. If further assistance is needed, please open a new support ticket at WPML support forum ."}
{"case_id": "392eea17cebbc910", "topic_url": "https://wpml.org/forums/topic/bug-report-js-error-conflict-with-rank-math-seo-after-wpml-4-8-2-update/?paged=2", "text": "2 The client reported a critical conflict between WPML Multilingual CMS (v4.8.2) and the Rank Math SEO plugin, which caused the WordPress 'Preview' function to break due to a JavaScript error. This issue began after updating WPML to version 4.8.2. Although Rank Math provided a patch for an SEO score display issue, it did not resolve the 'Preview' mode problem.", "solution": "We recommended the client to first take a backup of their site, including the database. Then, use the troubleshooting options available at WPML > Support > Troubleshooting: 1. Clear the cache in WPML 2. Fix element_type collation 3. Set language information More details on these steps can be found here: WPML Troubleshooting Options We also suggested checking if the issue replicates when creating a new translation for yet untranslated content or if it only affects a specific page or older content. Additionally, we offered to investigate further by requesting temporary access (wp-admin and FTP) to the website."}
{"case_id": "c759420667112eca", "topic_url": "https://wpml.org/forums/topic/the-language-switcher-on-the-mobile-menu-is-only-showing-a-piece-of-coding/#post-17551139", "text": "If you're experiencing issues with the language switcher on your mobile menu displaying coding instead of language flags and names, it's likely due to the theme bypassing wp_nav_menu() and its walkers, using wp_get_nav_menu_items() to grab raw items and rebuild its own HTML, which breaks the language switcher.", "solution": "We recommend you try the following steps to resolve this issue: 1. Ensure you have a backup of your site. 2. Open the ...partials/headers/parts/mobile_menu.php file. 3. Locate around line 17, right below the line: foreach ( (array) $menu_items as $key => $menu_item ) { 4. Add the following code: // Detect WPML LS with class 'wpml-ls-item'<br />$classes = is_array( $menu_item->classes ) ? $menu_item->classes : array();<br />if ( in_array( 'wpml-ls-item', $classes, true ) ) {<br />$menu_list .= '<div class=\"stm_lms_categories_dropdown__parent\">';<br />$menu_list .= do_shortcode( '[wpml_language_switcher]' );<br />$menu_list .= '</div>' + \"\\n\";<br />continue;<br />} Alternatively, you can use a custom language switcher and add it manually to the theme templates. For more details, visit Adding Language Switchers using PHP and Shortcodes ."}
{"case_id": "28ceefc7bdb3bfe4", "topic_url": "https://wpml.org/forums/topic/split-mismatches-between-number-of-products-included-in-categories/#post-17647592", "text": "The client reported multiple issues after noticing an error about the site not meeting WPML's minimum requirements, which later disappeared without any action taken by the client. The issues included mismatches in product counts across categories, the price filter not being visible or functioning correctly across different languages and views, and untranslated address information in the footer.", "solution": "We examined the mismatch in product counts within categories. It was found that the content and products were initially created in English and then translated, with English being the default language. The primary issue was with the products in the default language not being assigned to the correct categories. We recommend the client to review all products in the default language to ensure they are correctly categorized. This should be done with WPML disabled to confirm that the setup works independently of WPML. Once verified, WPML can be re-enabled to check if the translation issues persist. If problems continue, we advise opening a new support ticket."}
{"case_id": "24479facb4dc580d", "topic_url": "https://wpml.org/forums/topic/woocommerce-checkout-strings-not-using-wpml-translations/?paged=2", "text": "2 If you're experiencing issues where some WooCommerce checkout strings, such as 'Населённый пункт' and 'Saadetis', are not using the translations set in WPML → String Translation in both Estonian and Russian languages, despite having disabled automatic updates and cleared caches.", "solution": "We recommend exporting the .pot file with the updated strings from a test site where the issue is already resolved. You can do this via WPML → String Translation → Import/Export → Export strings. Then, import this .pot file into your live site using the same WPML → String Translation → Import/Export path. This process is safe to perform on a production site and should not affect your existing content or database structure. Additionally, this fix should remain effective after future WPML or WooCommerce updates, although you may need to re-scan for new strings or re-export/re-import the .pot file if updates introduce changes."}
{"case_id": "d9ac857c5bda9b52", "topic_url": "https://wpml.org/forums/topic/empty-cart-on-checkout/#post-17579564", "text": "The client activated the WPML plugin on their site and experienced an issue where the cart appears empty during the checkout process.", "solution": "We investigated the issue and found that it persists even when all WPML plugins are disabled. The client is using the Eventin plugin's custom checkout flow, which does not synchronize with the WooCommerce cart. This discrepancy is why the WooCommerce cart appears empty. We recommend checking if the Eventin and WooCommerce plugins are intended to work together or if there is a need for additional configuration to ensure compatibility."}
{"case_id": "e87818fcebadea51", "topic_url": "https://wpml.org/forums/topic/woodmart-variation-swatches-gone-on-translated-product/", "text": "(Woodmart) Variation swatches gone on translated product You are experiencing an issue where variation swatches display as image/button swatches on the original language page, but show as dropdown selects on the translated version.", "solution": "We found that the translated terms don't have the text swatch enabled. To resolve this, please edit the translated terms and enable the text swatch. Afterward, update the product in the default language by making a minor edit and then update it. This should ensure consistency across both languages."}
{"case_id": "d70d8e33d461a406", "topic_url": "https://wpml.org/forums/topic/disabling-automatic-translation/", "text": "Disabling automatic translation The client needed help with disabling automatic translation in WPML. The automatic translation icon kept spinning, and the client was unable to find the option to turn off automatic translation. Additionally, there was confusion about the renamed menu items and a large post_meta table.", "solution": "To disable automatic translation, we recommended the following steps: 1) Ensure that the option \"Translate Everything automatically\" is turned off in WPML > Translation Dashboard. 2) In the Advanced Translation Editor, access the settings in the top right corner and disable \"Translate all content automatically when the editor is opened\". 3) In WPML > Translation Tools > Automatic translation engines, disable all automatic translation engines. 4) In WPML > Translation Tools > Who can use Automatic Translation?, ensure that no admin or translator is enabled for automatic translation. Additionally, if the features of the Advanced Translation Editor are not needed, the client can switch to the Classic Translation Editor, which does not support automatic translation features like Glossary, Translation Memory, and Spellchecker. More information on using the Classic Translation Editor can be found here: Using the Classic Translation Editor ."}
{"case_id": "cb630428de1b8bac", "topic_url": "https://wpml.org/forums/topic/woocommerce-block-chart-proceed-to-checkout-label-translation/#post-17644960", "text": "You are trying to translate the 'Proceed to Checkout' label in the WooCommerce block chart to German, but it remains in English on your website.", "solution": "If you're experiencing this issue, it's due to a known problem with how WooCommerce Blocks handles certain text strings. We recommend you try the following workaround: https://wpml.org/errata/woocommerce-multilingual-cart-page-strings-not-translated-when-using-blocks/"}
{"case_id": "1d31859a5c0ffb48", "topic_url": "https://wpml.org/forums/topic/unable-to-open-fr-translation-for-home-eng-in-advanced-editor-due-to-error/#post-17617446", "text": "The client is experiencing a critical error when attempting to use the advanced editor for translating a page from English to French. The error message indicates a missing site key and issues with the WPML Translation Editor, potentially due to conflicts with hidden builder metadata or cached layout data from Visual Composer.", "solution": "We recommend creating a new page and manually copying the content from the problematic page to the new one. This approach often helps clear out any residual builder metadata that might be causing the issue."}
{"case_id": "3b88e67d6d418665", "topic_url": "https://wpml.org/forums/topic/constant-500-errors-linked-to-wpml/?paged=2", "text": "2 The client is experiencing persistent 500 errors linked to WPML on their staging site, despite extensive troubleshooting including deactivating less essential plugins, reverting to older WPML versions, and consulting forum topics. The errors persist even after enabling WordPress debugging and updating plugins.", "solution": "We recommended the following steps to further diagnose and potentially resolve the issue: 1. Enable WordPress debugging to capture specific error messages. This involves adding specific lines of code to the wp-config.php file to log errors without displaying them on the site. 2. Reproduce the error to trigger and log specific error messages, then share these messages for further analysis. 3. Ensure all WPML components are updated to the latest versions after ensuring a complete backup of the site and database. 4. If the issue persists, we advised checking the PHP memory limit and using WPML’s troubleshooting tools. If these steps do not resolve the issue or if the solution becomes outdated, we recommend opening a new support ticket. We also highly recommend checking related known issues at https://wpml.org/known-issues/ , verifying the version of the permanent fix, and confirming that you have installed the latest versions of themes and plugins. For further assistance, please visit our support forum at https://wpml.org/forums/ ."}
{"case_id": "75dff615b9dd7422", "topic_url": "https://wpml.org/forums/topic/errore-di-autenticazione-contatta-il-tuo-responsabile-delle-traduzioni-per-verificare-il-tuo-abbo/", "text": "Errore di autenticazione, contatta il tuo responsabile delle traduzioni per verificare il tuo abbo... If you're experiencing an authentication error ('Errore di autenticazione, contatta il tuo responsabile delle traduzioni per verificare il tuo abbonamento') while trying to translate a product using WPML, even though your license is valid, it might be due to a plugin conflict.", "solution": "We recommend deactivating the 'Add Admin CSS' plugin on your site, as it could be causing the conflict. After deactivating, please clear all caches (site, browser, server) to see if the issue resolves. Additionally, you may need to cancel any in-progress translation jobs at WPML -> Translation Dashboard -> Jobs. Test these steps and observe if the authentication error persists."}
{"case_id": "26cf60b9da2d5b7c", "topic_url": "https://wpml.org/forums/topic/saving-in-buddyboss-group-management-in-other-language-saves-the-the-other-language-as-first-languag/#post-17537089", "text": "When editing a BuddyBoss group in a secondary language, the system overwrites the original group name in the primary language, leading to inconsistencies.", "solution": "1. Ensure that the WPML String Translation plugin is active, as it is necessary for translating BuddyBoss groups. 2. Understand that BuddyBoss groups are not duplicated per language; they exist once in the database and are displayed in different languages using WPML String Translation. 3. Check the latest version of the BuddyPress Multilingual addon, which addresses this issue, by navigating to Plugins > Add new plugin on the \"Commercial\" tab and clicking \"Check for updates\". 4. If the problem persists, refer to the errata published by our team for more details: https://wpml.org/errata/buddyboss-issue-editing-group-title-and-description-from-profile-page-in-secondary-language/"}
{"case_id": "1526dc82de4be4a3", "topic_url": "https://wpml.org/forums/topic/logo-translation-7/#post-17667249", "text": "The client reported that their website logo was not appearing in any language after changing the 'ts_logo' setting to not translatable. Additionally, they experienced issues with images not showing on product pages.", "solution": "1. We recommended updating WPML plugins to ensure all bug fixes and improvements are applied: - Navigate to Plugins → Add New Plugin in the WordPress dashboard. - Click on the Commercial tab and then the Check for updates button. - Update WPML Multilingual CMS and WPML Multilingual & Multicurrency for WooCommerce. 2. We adjusted the 'ts_logo' translation preference to ensure it's correctly configured. 3. We suggested running the image regeneration tool to fix issues with images not displaying on product pages. You can find this tool at Image Regeneration Tool ."}
{"case_id": "d0bc31d3ce3332c5", "topic_url": "https://wpml.org/forums/topic/wpml-language-switcher-flags-menu-item-is-still-not-displaying-in-the-header/", "text": "WPML language switcher (flags) menu item is still not displaying in the header If you're experiencing issues with the WPML language switcher not displaying in the header of your site, particularly on the left side, this summary might help.", "solution": "We recommend adding the language switcher by navigating to WPML > Languages > Menu language switcher. This action should help in displaying the language flags correctly in your site's header. Please check your homepage after applying this change to see if it resolves the issue. Keep in mind that this solution might be outdated or not applicable to your specific case. If the problem persists,"}
{"case_id": "2d2b5e199d41b5a1", "topic_url": "https://wpml.org/forums/topic/translate-pages-6/#post-17622870", "text": "The client is experiencing issues with translating pages from English to Bulgarian using WPML. Initially, the translation process was not starting, and after resolving that, clicking 'Home' on the Bulgarian version redirected to the English version, although subsequent pages displayed in Bulgarian.", "solution": "1. We advised the client to increase the WordPress memory limit to ensure the site meets WPML's minimum requirements. This can be done by adding the following line to the wp-config.php file: /* Memory Limit */<br />define('WP_MEMORY_LIMIT', '256M'); This line should be placed above the '/* That's all, stop editing! Happy blogging. */' line. 2. To address the translation not starting, we recommended sending the content for translation through the WPML Translation Dashboard. Detailed steps can be found here: https://wpml.org/documentation/translating-your-contents/#how-to-use-translation-dashboard 3. For the issue with the home page redirection, we suggested checking if the home page is translated and the translation is published. If these steps do not resolve your issues or if the solution seems outdated or irrelevant to your case,"}
{"case_id": "873785372f63d8aa", "topic_url": "https://wpml.org/forums/topic/andern-sie-die-ubersetzungseinstellung-der-feldgruppe-notification-in-admin-fatal-error-php-fata/", "text": "Ändern Sie die Übersetzungseinstellung der Feldgruppe. Notification in Admin, Fatal Error PHP Fata... You are experiencing a warning message in the WordPress backend every time you try to edit posts, accompanied by a PHP Fatal error in the debug log. This issue is related to the WPML String Translation plugin and involves the handling of empty HTML script tags.", "solution": "To prevent the warning message and address the PHP Fatal error, follow these steps: 1. Navigate to WPML > Settings > Post Types Translations. 2. Set ACF Field Groups to \"Not translatable\". This is crucial as setting them to \"Translatable\" can cause issues when using the \"Advanced Custom Fields Multilingual\" addon."}
{"case_id": "2389abaf854460e6", "topic_url": "https://wpml.org/forums/topic/translating-with-ate/", "text": "Translating with ATE You are trying to translate Kadence elements using ATE, but are encountering issues where items unexpectedly get flagged for later, and translations are being removed. This problem makes manual translation seem easier compared to using ATE.", "solution": "We have identified that this is a known issue affecting other clients as well. We are currently developing a fix, which will be included in an upcoming release. Unfortunately, we do not have a specific timeline for this release yet. For more details, you can check the related known issue here: https://wpml.org/errata/ate-some-segments-are-automatically-marked-as-flagged-for-later/"}
{"case_id": "84666da23d64ed7a", "topic_url": "https://wpml.org/forums/topic/wpml-changing-urls-on-the-fronend/?paged=2#post-17517211", "text": "You are trying to have a legal page with multiple languages, each linking to the appropriate privacy policy URL. However, all the URLs are correct in the WordPress dashboard but are being modified on the front end to only link to the English privacy policy.", "solution": "We recommend you follow these steps to ensure each language links to the correct privacy policy URL: 1. Install the Sticky Links plugin by going to Plugins -> Add New -> Commercial. 2. Add the following code snippet to your theme's functions.php file: add_filter( 'wpml_sl_blacklist_requests', function( $blacklist ) {<br /> $blacklist[] = 'calm-health-privacy-policy';<br /> return $blacklist;<br />}, 10, 1 ); 3. Resave your permalinks by going to Settings -> Permalinks. This should ensure that the links from the English page correctly link to their respective language versions."}
{"case_id": "b429368e470f62f9", "topic_url": "https://wpml.org/forums/topic/installing-wpml-in-our-staging-enviroment/", "text": "installing WPML in our staging enviroment The client was experiencing an issue where the WPML installer was stuck in a loop during installation on their staging environment.", "solution": "We resolved the issue by taking the following steps: 1. We removed the existing copies of the WPML plugins. 2. We uploaded freshly downloaded versions of the WPML plugins. 3. We accessed the database and deleted the problematic option in the wp_options table named auto-translation-job-creation-error . After these steps, we successfully activated the WPML plugins on the staging site."}
{"case_id": "1e711e5d39738091", "topic_url": "https://wpml.org/forums/topic/internal-server-error-message/#post-17616733", "text": "If you're experiencing an Internal Server Error on the French version of your website after using WPML to translate from Arabic to English and French, the issue might not be with the .htaccess file itself.", "solution": "We recommend trying the workaround detailed in this documentation: https://wpml.org/faq/why-is-htaccess-getting-overwritten-with-the-language-folder-on-my-wpml-website/ . You should add the workaround to the functions.php file of your parent theme. However, to avoid losing this change during theme updates, we suggest switching to a child theme and adding the workaround there."}
{"case_id": "e5ed3b7c06bd531f", "topic_url": "https://wpml.org/forums/topic/website-loging-is-high-due-to-plugin/#post-17573394", "text": "You are experiencing low site loading speeds due to the wp-wpml_current_language cookie, which is set only after the first response. This issue prevents the cache plugin from caching the first request. Additionally, the use of multi-currency based on IP also hinders caching.", "solution": "It is normal for WPML with the multi-currency feature to not serve the first visit from cache. WPML needs the initial request to detect the visitor's correct currency using GeoIP or rules. After the currency is set, all subsequent pages can be fully cached. This behavior ensures that clients can switch currencies, as they would otherwise be served the same cached version with the outdated currency settings. For more details on how caching might affect multi-currency settings in WPML, please visit https://wpml.org/errata/caching-plugins-may-cause-issues-with-wcml-multi-currency-settings/ ."}
{"case_id": "0ccc78e652316344", "topic_url": "https://wpml.org/forums/topic/initial-wpml-setup-rest-api-error/#post-17539648", "text": "The client is setting up WPML on a site under development and encounters an issue where the WordPress REST API test endpoint is not responding correctly, which is essential for WPML to function properly.", "solution": "We recommend checking if this is a false positive by opening the URLs shown in the screenshot provided in the support ticket. If these URLs open and display data, then the REST API is functioning correctly. You can find more information on REST API dependencies here: https://wpml.org/documentation/support/rest-api-dependencies/ . If the URLs do not open or display an error, it's possible that a security setting or a plugin is restricting access to the REST API."}
{"case_id": "c26ec7813700d175", "topic_url": "https://wpml.org/forums/topic/more-than-one-page-for-same-language-in-hreflang-hreflang-to-redirect-missing-translated-homepag/?paged=2", "text": "2 The client is trying to ensure that only one page is referenced for each language in hreflang annotations on their homepage. Additionally, the translated (en-ca) homepage is not appearing in the page-sitemap. Unexpectedly, there is an additional 301 redirect hreflang tag to the full en-ca homepage URL, and the en-ca homepage is not visible in the page-sitemap.", "solution": "To address the hreflang annotations, we recommend modifying the code in the WPML SEO plugin. Open the file at ...\\wp-content\\plugins\\wp-seo-multilingual\\classes\\Shared\\Sitemap\\BaseAlternateLangHooks.php . On line 61, replace: $link[ self::KEY ][ $lang ] = apply_filters( 'wpml_permalink', $link['loc'], $lang ); with: $link[ self::KEY ][ $lang ] = apply_filters( 'wpml_permalink', $link['loc'], $lang, true ); Apply the same change on line 89. For the sitemap issue with Rank Math, navigate to \"Rank Math > Sitemaps settings\" and alter the \"Links per sitemap\" number then save. This action will rebuild the sitemaps. You can revert to the original number after this change. If these steps do not resolve your issue or if the solution becomes outdated,"}
{"case_id": "ffa322302e5bad68", "topic_url": "https://wpml.org/forums/topic/translations-stuck-in-progress-ate-xliff-file-cannot-be-read/?paged=2", "text": "2 You are trying to update and resend page translations from English to Portuguese using the Advanced Translation Editor (ATE), but all translation jobs remain stuck in 'In progress'. The ATE error log indicates 'XLIFF Server Communication – The xliff file could not be read.' Despite increasing the WordPress WP_MEMORY_LIMIT to 512M, the PHP memory limit still shows as 128M.", "solution": "We recommend updating your WPML to the latest version, which is 4.8.3 . This update might resolve the issue with the stuck translation jobs and the XLIFF file errors. You can find the latest WPML releases in your account under My Account → Downloads. For instructions on how to update WPML, please visit http://wpml.org/faq/install-wpml/ . If the update option isn't visible immediately, try clicking the 'Check for updates' button under Plugins → Add New Plugin → Commercial."}
{"case_id": "b45ca334095c80d7", "topic_url": "https://wpml.org/forums/topic/product_type-field-was-set-incorrectly-for-some-product-translations-2/?paged=1", "text": "1 You are experiencing issues with product translations on your WooCommerce site using WPML, specifically with incorrect settings for the product_type field and non-equivalent products in different languages.", "solution": "First, ensure that the product_type and product_visibility fields are set to 'Not translatable' in WPML → Settings. This adjustment prevents these fields from being incorrectly translated. Next, to make all products visible, disable the 'Hide out of stock items from the catalog' option in WooCommerce → Settings → Products → Inventory."}
{"case_id": "0a295efa09844d8e", "topic_url": "https://wpml.org/forums/topic/wpml-has-attempted-to-translate-this-page-three-times-and-failed/", "text": "WPML has attempted to translate this page three times and failed. On four websites, the WPML plugin fails to translate the 'Gastronomie' page, showing an error that WPML has attempted to translate the page three times unsuccessfully. The issue persists across all sites with this specific page.", "solution": "1. Cancel the in-progress translation job for the 'Gastronomie' page by navigating to WPML -> Translation Management -> Translation Jobs. 2. Make a minor edit to the original 'Gastronomie' page. 3. Change the translation setting for the _elementor_data custom field from 'Translate' to 'Copy' by going to WPML → Settings → Custom Fields Translations, clicking on Show Custom Fields, and adjusting the setting. 4. Disable the Multilingual Tools plugin. 5. Update the page and attempt to edit the translations again. If these steps do not resolve the issue or if the solution seems outdated or irrelevant to your case,"}
{"case_id": "6e3f76bbfc7ad56a", "topic_url": "https://wpml.org/forums/topic/unable-to-finish-setup-stuck-on-step-4-ai-translation/", "text": "Unable to finish setup: Stuck on Step 4 AI Translation The client was unable to complete the WPML setup, specifically stuck at Step 4: AI Translation. They encountered a console error indicating a 'SyntaxError: Failed to execute 'json' on 'Response': Unexpected end of JSON input.' This issue occurred during the setup process, even after disabling other plugins and using a default theme.", "solution": "We resolved the issue by enabling cURL on the client's server. This adjustment allowed the client to proceed with the WPML setup and successfully use the plugin for content translation. It's important to ensure that your server has the necessary configurations, such as cURL enabled, to support all WPML functionalities."}
{"case_id": "b8bd891218e2a1d2", "topic_url": "https://wpml.org/forums/topic/elementor-does-not-save-when-wpml-is-active-and-we-use-the-full-width-templae/?paged=1", "text": "1 If you're experiencing issues with saving pages using the Elementor Full Width template when WPML is active, such as receiving an 'Access Denied' error, missing background images, or CSS styling issues, we have identified a solution.", "solution": "We recommend adding custom CSS to your site to address these issues. This CSS ensures that Elementor-rendered pages are displayed correctly with WPML. Here is the CSS you should add: /* Only affect Elementor-rendered pages */<br />body.elementor-page .site .wp-block-group,<br />body.elementor-page .site .post-inner,<br />body.elementor-page .site .entry-content > * {<br /> max-width: none !important;<br />}<br /><br />/* Make Elementor full-width sections/containers truly edge-to-edge */<br />body.elementor-page .elementor-section.elementor-section-full_width > .elementor-container,<br />body.elementor-page .e-con.e-con-full {<br /> width: 100vw !important;<br /> max-width: 100vw !important;<br />}<br /><br />/* Center the 100vw sections and allow bleed */<br />body.elementor-page .elementor-section.elementor-section-full_width {<br /> margin-left: calc(50% - 50vw) !important;<br /> margin-right: calc(50% - 50vw) !important;<br /> overflow: visible !important;<br />}<br /><br />/* Prevent an ancestor from clipping the bleed */<br />body.elementor-page #page,<br />body.elementor-page .site {<br /> overflow-x: visible;<br />}"}
{"case_id": "b16ec008080e4ffd", "topic_url": "https://wpml.org/forums/topic/language-selector-twig-template-aria-label-and-title-attributes-not-rendering-in-final-markup/#post-17631184", "text": "The client is preparing for the launch of their site and during WCAG testing, discovered that the language selector does not contain aria-labels or titles. Despite these attributes being set in the Twig templates for both legacy dropdown and legacy dropdown on click, they are not present in the rendered markup.", "solution": "We recommend converting the custom language switcher from a .twig template to a PHP-based implementation, as Twig will be removed entirely from WPML in future releases. Regarding the missing aria-labels, this issue has been reported to our development team, and it will be improved. However, we cannot guarantee a specific timeline for this fix."}
{"case_id": "56690d3c8ec6b02c", "topic_url": "https://wpml.org/forums/topic/i-installed-wpml-and-get-a-404-on-my-team-members-pages/", "text": "I installed WPML and get a 404 on my team members pages After installing the WPML plugin, the client's team member pages are showing a 404 error. Additionally, there is a warning message about the page being translated into English when trying to edit the page.", "solution": "The 404 error typically occurs because a translation for the page and/or post does not exist or has not yet been published. We recommend checking if all team members and services are translated into all required languages and ensuring that these translations are published. If this does not resolve the issue, we suggest backing up your website and database, then providing us with admin access to take a closer look. You can submit your details securely using the private reply form when you log in to leave your next reply. For further assistance, please visit our support forum at https://wpml.org/forums/ ."}
{"case_id": "ec9601f7eb68dba3", "topic_url": "https://wpml.org/forums/topic/translated-menus-broken/", "text": "Translated Menus broken You are trying to edit the menu on your WordPress site using WPML and expect to see different menus in different languages. However, all menus are appearing in one language only.", "solution": "We recommend temporarily disabling WPML for one or two minutes to test if the issue persists. This step will help determine if the problem is related to WPML or possibly another factor, such as a caching plugin. If the issue is resolved when WPML is disabled, it suggests that the problem might be related to how WPML interacts with other plugins or settings on your site."}
{"case_id": "e3a2dff527652d58", "topic_url": "https://wpml.org/forums/topic/split-unable-to-trigger-upload-dialog-on-wpml-media-translation/?paged=1", "text": "1 The client reported issues with WPML Media Translation after updating WPML and using the Enable Media Replace plugin. Specifically, after replacing media files, the connection between the original and translated media was lost, causing translation issues and errors in media synchronization.", "solution": "1. We confirmed that the issue does not occur with new image uploads but persists with existing media. Running a media synchronization for 'Existing content' at WPML > Settings > Media Translation can resolve the issue. 2. The issue with the Enable Media Replace plugin is known and a fix is expected as discussed here: https://wordpress.org/support/topic/problem-with-wpml-45/ 3. If the problem persists, especially with older media entries, syncing the existing media at WPML > Settings > Media Translation should resolve the issue."}
{"case_id": "db8a314517c8ee81", "topic_url": "https://wpml.org/forums/topic/alt-text-translations-not-applying-on-frontend-layout-issues/?paged=1", "text": "1 The client was experiencing issues with WPML on their website using Bricks Builder. Specifically, translated ALT text attributes were not displaying correctly, showing the original Polish ALT text instead of the translated versions. Additionally, there were problems with the Bricks Builder translation workflow on the homepage, requiring multiple resends for translation before the layout displayed correctly.", "solution": "For the translated ALT text issue, we recommended the following steps: 1. Check the WordPress memory limit in WPML → Support and increase it if necessary by adding define('WP_MEMORY_LIMIT', '256M'); in the wp-config.php file. 2. Ensure that the WPML Media Translation add-on is active and that the ALT texts for images are translated in WPML → Media Translation . 3. Re-translate specific ALT text strings by deleting the existing translations in WPML → String Translation , re-registering the string by visiting the page, and then re-translating the string. For the Bricks Builder translation workflow issue: 1. Confirm that both Bricks Builder and all WPML plugins are updated to the latest versions. 2. Use specific WPML Troubleshooting tools in WPML → Support → Troubleshooting to synchronize content and language information. 3. After troubleshooting, re-save and resend the homepage for translation in Bricks Builder to check if the layout displays correctly. Workaround: Open the ...\\wp-content\\themes\\bricks\\includes\\elements\\image.php file Line 751 Replace: $image_id = isset( $image['id'] ) ? $image['id'] : ''; With: $image_id = isset( $image['id'] ) ? apply_filters( 'wpml_object_id', $image['id'], 'attachment', TRUE ) : ''; If these steps do not resolve the issues or if the solution becomes outdated, we recommend checking related known issues at https://wpml.org/known-issues/ , verifying the version of the permanent fix, and confirming that you have installed the latest versions of themes and plugins. If problems persist, please open a new support ticket at WPML support forum ."}
{"case_id": "00dbc5d44ca4330a", "topic_url": "https://wpml.org/forums/topic/buddyboss-profile-fields-not-translated/", "text": "buddyboss profile fields not translated The client is experiencing issues with BuddyBoss profile fields not displaying their French translations in the app, despite the translations being visible in the WPML String Translation interface.", "solution": "1. Ensure that BuddyBoss profile fields are registered for translation. This can be done from the BuddyBoss → Profile Fields section in the WordPress dashboard. 2. If the issue persists, it may be due to a conflict with a third-party plugin. We recommend: - Cloning the site to a staging environment. - Deactivating plugins one by one to identify the conflicting plugin. - Testing the translation again using the String Translation interface after each deactivation. 3. If you are unable to identify the conflicting plugin, consider backing up your site, switching to maintenance mode, and deactivating all third-party plugins temporarily to test the translations. If these steps do not resolve your issue or if the solution seems outdated or irrelevant to your case,"}
{"case_id": "c7bf1c607a0df2a2", "topic_url": "https://wpml.org/forums/topic/i-need-to-translate-using-elementor-but-i-do-not-want-to-use-the-translation-editor-its-too-slow-a/#post-17506482", "text": "You are developing a site and want to translate pages using Elementor without using the WPML translation editor due to its slow performance.", "solution": "We recommend using the \"WordPress Editor\" option to create and edit translations using the WP Editor, which allows for integration with Elementor. To do this, select the \"WordPress Editor\" option within the WP Editor of a page. You can then decide if this setting should apply to all pages or only the current one. When adding a translation by clicking the \"+\" sign, choose to copy the content from the original page so you can replace only the parts you need. We advise making a few tests to familiarize yourself with how it works in practice. Please note, avoid using the duplicate or overwrite options as they will keep the translations as duplicates, always in sync with the original."}
{"case_id": "1d30d2313b8723e6", "topic_url": "https://wpml.org/forums/topic/useless-advice-from-now-two-supporters-code-does-not-change-from-en-to-en-gb/", "text": "useless advice from now two supporters, code does not change from en to en-gb The client is experiencing an issue where the language code in the URL does not change from 'en' to 'en-gb' as specified, resulting in incorrect URLs. Additionally, there is no option to edit the language as the locale already exists.", "solution": "We recommend creating a new custom language with the desired language code '/en-gb/'. If you encounter a message stating that the locale (e.g., en_US) already exists, this indicates it is assigned to another language, typically the default English language in WPML. To assign the locale to your custom language, follow these steps: 1. Navigate to WPML → Languages and ensure the default English language is active. 2. Edit the English language and temporarily change its locale to a different, unused value (e.g., en_EN). 3. Save the changes. 4. Add your custom language and assign the desired locale to it. For more detailed instructions, please visit: Editing WPML's Languages Table If the solution provided does not apply to your case, or if it seems outdated,"}
{"case_id": "f9d9766d72fca80f", "topic_url": "https://wpml.org/forums/topic/gutenberg-navigation-language-switcher-block/#post-17645267", "text": "The client wants to display only the non-active language in the WPML Language Switcher Block within a block-based menu using the twentytwentyfour Theme, but cannot find the setting to achieve this.", "solution": "Currently, it is not supported to hide the current language in the Language Switcher block. This feature has been requested and the client's ticket has been linked to the feature request for additional support. Meanwhile, we recommend trying the workaround suggested in this forum thread: https://wpml.org/forums/topic/i-would-like-the-language-switcher-show-the-name-of-the-other-language-not-the-active-one/#post-16378075"}
{"case_id": "5bcec481fdf9b674", "topic_url": "https://wpml.org/forums/topic/error-notification-wpml-tried-to-translate-this-page-three-times-and-failed-to-get-it-fixed-cont/", "text": "Error notification “WPML tried to translate this page three times and failed. To get it fixed, cont... If you're experiencing issues with opening the French translation editor on your website, where WPML displays an error message stating it tried to translate the page three times and failed, we can help you resolve this.", "solution": "1. Open the default language Home page in Edit mode. 2. Make a small change, such as adding a space or a plus sign in your page title. 3. Update the page by pressing the “Update” button. 4. Remove the small change you made in step 2. 5. Update the page again. 6. Try to open the translated French language page in WPML Translation Editor and ensure the translation is 100% complete, then press the Complete Translation button. If the problem persists, follow these steps: 1. Ensure you have a backup of your site. 2. Increase the WP Memory Limit to at least 128MB by adding the following line to your wp-config.php file: /* WP Memory Limit */<br />define('WP_MEMORY_LIMIT', '256M'); Place it before the line: /* That's all, stop editing! Happy blogging. */ 3. Update WPML to the latest version, currently 4.8.5. 4. Go to WPML >> Support > Troubleshooting page and press the following buttons: - Clear the cache in WPML - Synchronize posts taxonomies - Remove ghost entries from the translation tables - Synchronize local job ids with ATE jobs - Synchronize translators and translation managers with ATE - Assign translation status to duplicated content - Fix post type assignment for translations - Set language information If these steps do not resolve the issue, please visit the known issues page , verify the version of the permanent fix, and confirm that you have installed the latest versions of themes and plugins. If the problem still persists, we recommend opening a new support ticket. For further assistance, you can also visit our support forum ."}
{"case_id": "6f6c190fcb0351ea", "topic_url": "https://wpml.org/forums/topic/we-have-detected-a-problem-with-some-tables-in-the-database-14/", "text": "We have detected a problem with some tables in the database. After the last update, the website became very slow. Disabling the WPML plugins temporarily resolved the issue, but reactivating them triggered an error related to WP Endpoints and database entries.", "solution": "If you're experiencing this issue, it might be due to one of two reasons: either WPML was previously used and reset, or the database prefix changed. We recommend trying the workaround provided in the following errata . Please ensure that WPML is enabled when applying this workaround. If this does not resolve the issue, or if you need assistance with the workaround, do not hesitate to contact us."}
{"case_id": "4a0639062e0b866e", "topic_url": "https://wpml.org/forums/topic/media-library-shows-duplicate-images-in-the-default-language-italian-after-activating-wpml-media-t/", "text": "Media library shows duplicate images in the default language (Italian) after activating WPML Media T... The client is developing a site with Italian as the default language and English as an additional language. After activating WPML Media Translation, some images in the Media Library are duplicated in the default language (Italian), with the same filename, file path, and both marked with the Italian flag. Each duplicated pair points to the same physical file and appears under the Italian tab, causing confusion about why there are two Italian attachments for the same image instead of one in Italian and one in English.", "solution": "1. **Increase WordPress Memory Limit**: We recommend increasing your WordPress memory limit to at least 128MB, or ideally 256MB. You can do this by editing your wp-config.php file and adding or modifying the line: define('WP_MEMORY_LIMIT', '256M'); 2. **Backup Your Site**: Always create a full backup of your site and database before making changes. 3. **Adjust Media Translation Settings (Temporarily)**: To prevent further unwanted entries while cleaning up, adjust the setting in WPML → Settings under the Media Translation section by unchecking the problematic option."}
{"case_id": "51064876e342658f", "topic_url": "https://wpml.org/forums/topic/recipies-issue/", "text": "Recipies Issue The client is using a recipe plugin and has translated a blog post with a connected recipe using WPML. However, after translation, the recipe disappeared from the translations and is not visible in the post itself or in the translation panel.", "solution": "1. Re-send the recipe for translation in WPML > Translation Dashboard, ensuring it is translated before translating the post that contains it. 2. Always translate from the 'inside out'. First, ensure all recipes are translated since they are embedded within the posts, and then translate the posts. 3. Empty your caches after changing content and after sending content for translation to avoid issues with caching interfering in your translation list. 4. To edit the translated post using the WordPress Editor, ensure to select the \"WordPress Editor\" option before editing to prevent translations from being overwritten. For more details, visit Using Different Translation Editors for Different Pages ."}
{"case_id": "03acc58fe1efe456", "topic_url": "https://wpml.org/forums/topic/some-core-blocks-are-not-available-for-translation/?paged=2", "text": "2 The client is attempting to translate an article using WPML but encounters an issue where some text elements remain in English because they are not available for translation. The client questions why some core blocks are not available for translation and how to ensure all text elements are translated.", "solution": "We recommend the following steps to ensure all text elements are picked up and translated: 1. Send the page for translation or update the existing translation: * Go to WPML → Translation Dashboard in your WordPress admin. * Use the filters to find your article. If the issue persists, it might be due to the use of emojis or specific characters that are not supported by the current database collation. In such cases, changing the database collation to \"utf8mb4_unicode_520_ci\" might resolve the issue. Additionally, consider manual translation for pages with complex designs or frequent changes, as detailed in our documentation on using different translation editors for different pages ."}
{"case_id": "982218c2a4b876d1", "topic_url": "https://wpml.org/forums/topic/animation-addons-for-elementor-wealcoder/#post-17536653", "text": "Wenn Sie das Plugin 'Animations Addons for Elementor' von Wealcoder verwenden und feststellen, dass die Inhalte der Animations-Module (z. B. Animated Text, Animated Title) nicht im WPML Translation Manager (Advanced Translation Editor) erscheinen, liegt das Problem darin, dass diese Inhalte nicht erkannt werden.", "solution": "Öffnen Sie die Datei ...animation-addons-for-elementor/inc/class-wcf-custom-cpt.php . Suchen Sie die Zeile 104, wo die Custom Post Types und Taxonomien zu spät registriert werden. Ersetzen Sie: add_action( 'init', [$this,'setup_post_type'], 8 );<br />add_action( 'init', [$this,'register_cpt'] , 100);<br />add_action( 'init', [$this,'register_taxonomes'] , 60); mit: add_action( 'init', [$this,'setup_post_type'], 8 );<br />add_action( 'init', [$this,'register_cpt'] , 10);<br />add_action( 'init', [$this,'register_taxonomes'] , 9); Bitte informieren Sie uns, ob diese Änderung das Problem behebt. Es wäre auch ratsam, den Autor des Plugins zu kontaktieren, damit er diese Korrektur in die nächste Version aufnehmen kann. Beachten Sie, dass diese Lösung möglicherweise veraltet oder nicht auf Ihr Problem zutreffend ist. Wir empfehlen Ihnen, die bekannten Probleme zu überprüfen, die Version der dauerhaften Lösung zu bestätigen und sicherzustellen, dass Sie die neuesten Versionen von Themes und Plugins installiert haben. Sollte das Problem weiterhin bestehen, zögern Sie nicht, ein neues Support-Ticket zu eröffnen. 0 15 1 month, 3 weeks ago Lauren"}
{"case_id": "9b6573bec928730b", "topic_url": "https://wpml.org/forums/topic/translating-search-filter-fields/?paged=2#post-17607197", "text": "The client was experiencing issues with the Advanced Translation Editor (ATE) in WPML, specifically receiving errors such as 'Unable to retrieve job details' and 'Jobs could not be loaded' while trying to translate Search & Filter fields using ACF and Elementor Pro.", "solution": "1. Ensure all WPML plugins are updated to the latest versions by navigating to Plugins → Add New → Commercial tab. 2. Clear all caches, including WPML's cache, by going to WPML → Support → Troubleshooting and using the provided tools. 3. Verify the ATE API connection under WPML → Settings → Translation Editor . 4. Use WPML's troubleshooting tools to remove ghost entries and fix database collation issues. 5. Check Elementor widgets for excessively long strings or complex content that might be causing issues. 6. Install and activate the ACF Multilingual plugin, set ACF field translation preferences, and update original posts/pages to trigger new translation settings. 7. If issues persist, manually inspect WPML job queues and database for stalled or corrupted translation jobs. 8. Review for known WPML/ACFML conflicts, especially with Elementor, and check logs for related errors. If these steps do not resolve the issue or if the solution seems outdated or irrelevant to your specific case,"}
{"case_id": "045abebc13b8d3fd", "topic_url": "https://wpml.org/forums/topic/elementor-does-not-save-when-wpml-is-active-and-we-use-the-full-width-templae/?paged=2#post-17498431", "text": "If you're experiencing issues with saving pages using the Elementor Full Width template when WPML is active, such as receiving an 'Access Denied' error, missing background images, or CSS styling issues, we have identified a solution.", "solution": "We recommend adding custom CSS to your site to address these issues. This CSS ensures that Elementor-rendered pages are displayed correctly with WPML. Here is the CSS you should add: /* Only affect Elementor-rendered pages */<br />body.elementor-page .site .wp-block-group,<br />body.elementor-page .site .post-inner,<br />body.elementor-page .site .entry-content > * {<br /> max-width: none !important;<br />}<br /><br />/* Make Elementor full-width sections/containers truly edge-to-edge */<br />body.elementor-page .elementor-section.elementor-section-full_width > .elementor-container,<br />body.elementor-page .e-con.e-con-full {<br /> width: 100vw !important;<br /> max-width: 100vw !important;<br />}<br /><br />/* Center the 100vw sections and allow bleed */<br />body.elementor-page .elementor-section.elementor-section-full_width {<br /> margin-left: calc(50% - 50vw) !important;<br /> margin-right: calc(50% - 50vw) !important;<br /> overflow: visible !important;<br />}<br /><br />/* Prevent an ancestor from clipping the bleed */<br />body.elementor-page #page,<br />body.elementor-page .site {<br /> overflow-x: visible;<br />}"}
{"case_id": "16f200fd18307294", "topic_url": "https://wpml.org/forums/topic/wpml-add-ons-showing-as-not-installed-in-support-tab-despite-being-installed/#post-17659701", "text": "The client is experiencing an issue where WPML add-ons such as WPML String Translation, WPML CMS Navigation, WPML Media Translation, and WooCommerce Multilingual & Multicurrency are installed and active, but still appear as 'Not installed' in the WPML → Support section. Despite trying steps like reactivating plugins in the recommended order and re-registering WPML, the issue persists.", "solution": "We acknowledge this problem and recommend ignoring it for now as it does not impact the functionality of the site or the plugins. The plugins should continue to operate normally. We will include a fix in an upcoming release."}
{"case_id": "210a64a13ef42f61", "topic_url": "https://wpml.org/forums/topic/when-i-change-the-language-of-my-site-a-number-of-problems-arise-such-as-some-parts-not-being-tran/", "text": "When I change the language of my site, a number of problems arise, such as some parts not being tran... The client's multilingual website using WPML was experiencing several issues when switching languages to Persian or Arabic: parts of the site were not translated, images and accommodations disappeared, and the footer was not translated.", "solution": "1. We deactivated WPML Multilingual & Multicurrency for WooCommerce as it was not in use. 2. We updated WPML from version 4.8.3 to 4.8.4. 3. We ran all the troubleshooting options in WPML -> Support -> Troubleshooting. 4. In WPML -> Translations, we approved all the translations. 5. In WPML -> Settings -> Media translation, we duplicated all the images into Arabic and Persian. 6. We edited the Listing Categories in Arabic and Persian and added the respective images. These images were added in a special field from the Media Library. 7. We added the footer strings to WPML -> Strings Translation, allowing for their translation."}
{"case_id": "20288c0d0f13f911", "topic_url": "https://wpml.org/forums/topic/the-translator-could-not-be-assigned-to-the-job-8/#post-17571671", "text": "If you're experiencing issues with assigning translators to translation jobs in WPML and encountering errors, it might be due to restrictions set by your hosting provider on your database user or blocked connections to WPML-related domains.", "solution": "We recommend checking with your hosting provider to ensure that your database user does not have any restrictions, particularly with commands like ALTER . Also, verify that connections to wpml.org and ate.wpml.org are not being blocked. Once these issues are resolved, the translation functionality should work correctly."}
{"case_id": "b8bf2131f99270eb", "topic_url": "https://wpml.org/forums/topic/wp_installer_settings-on-autoload-maxing-out-an-causing-502-errors-on-site/#post-17552988", "text": "The client is experiencing 502 bad gateway errors on their site. The hosting provider identified that the 'wp_installer_settings' from wpml-string-translation is maxing out the autoload options, contributing significantly to the issue. The client is considering turning the autoload to OFF for 'wp_installer_settings' and 'wpml_strings_need_links_fixed'.", "solution": "We advised the client against disabling the autoload for 'wp_installer_settings' and 'wpml_strings_need_links_fixed' as it is not recommended. Instead, we suggested the following steps to diagnose and potentially resolve the issue: 1. Create a full site backup. 2. Update any outdated plugins or themes. 3. Flush any cache memory. 4. Activate WordPress debug mode as described in this guide . 5. Deactivate all plugins, including WPML ones, and activate a default WordPress theme like Twenty Twenty. 6. Reactivate the WPML plugins and then activate the theme and other plugins one by one to identify the culprit. 7. Check for any fatal errors in the debug.log file within the wp-content folder. Additionally, we informed the client that the next WPML version (v4.9) will have a much smaller 'wp_installer_settings', although there is no estimated time of arrival for this update."}
{"case_id": "2c69948ec80aecb9", "topic_url": "https://wpml.org/forums/topic/woocommerce-variations-no-visible/", "text": "WooCommerce Variations No Visible The client is experiencing issues with WooCommerce product variations not displaying when the WPML Multilingual CMS plugin is active. Despite deactivating other plugins and changing themes, the problem persists only when WPML is active. The variations tab shows the count but not the actual variations, and products sometimes display as 'Out of Stock' or 'Unavailable'.", "solution": "We recommend the following steps to potentially resolve the issue: 1. Ensure a full site backup is in place. 2. Update all outdated plugins and themes. 3. Clear any existing cache. 4. Deactivate all plugins, including WPML ones, and switch to a default WordPress theme like Twenty Twenty. 5. Reactivate WPML plugins, WooCommerce, and WooCommerce Multilingual. 6. Navigate to WPML -> Support -> Troubleshooting and perform the following actions: - Clear the Cache in WPML - Remove ghost entries from the translation tables - Fix element_type collation - Fix WPML table collation - Set language information - Cleanup and optimize string tables - Clear invalid strings 7. Follow the WCML troubleshooting steps . 8. Edit a product in the original language, make minor changes to the content and variations, and save these changes. Update the translation accordingly. 9. If the issue resolves, reactivate other plugins one by one to identify any conflicts. If these steps do not resolve the issue or if the solution seems outdated or irrelevant to your specific case, please check related known issues at https://wpml.org/known-issues/ , verify you have the latest versions of themes and plugins, and consider opening a new support ticket for further assistance at WPML support forum ."}
{"case_id": "cf972e3b04927bb4", "topic_url": "https://wpml.org/forums/topic/i-use-directories-pro-plugin-and-in-the-directory-the-open-close-badge-is-only-available-in-the-main/#post-17589959", "text": "The client is using the Directories Pro plugin and is facing an issue where the open/close badge is only visible in the main language (Swedish) on their site, but not in Norwegian and English.", "solution": "We asked the client to explain how the open/close badge is set up in the main language and to provide screenshots to better understand the configuration. This information is crucial for us to diagnose the issue and provide a specific solution. However, the client later updated that with the latest update of the Directories Pro plugin, the issue was resolved, and the open/close badge started appearing correctly in all languages. If you're experiencing a similar issue, we recommend checking if you have the latest updates for your plugins and themes. Sometimes, updates can resolve translation-related issues. If the problem persists, please visit our support forum for further assistance. We also highly recommend checking related known issues at https://wpml.org/known-issues/ , verifying the version of the permanent fix, and confirming that you have installed the latest versions of themes and plugins. 1 13 1 month ago annikaN-2"}
{"case_id": "526764623a6ebd29", "topic_url": "https://wpml.org/forums/topic/confirming-payment-renewed/", "text": "Confirming payment renewed You need confirmation if automatic renewal is in place for your subscription, and you want to know which credit card is currently active for the next payment.", "solution": "If you enter your credit card details and click Change payment method , the card is saved only if the system shows a successful confirmation with no error message. If the page is closed, refreshed, or if Cancel payment change is clicked, the card is not saved. After the card is saved successfully, the renewal will be processed automatically on the due date. You do not need to take any further action. As long as the card is valid, has sufficient funds, and allows online payments, the renewal will go through without issue."}
{"case_id": "29f6ac5111ca1cda", "topic_url": "https://wpml.org/forums/topic/where-is-the-translation-of-home-page-filtering/#post-17549130", "text": "The client is experiencing issues with the translation of home page filtering not appearing as expected on their website.", "solution": "We recommend the following steps to resolve the issue: 1. Ensure all WPML plugins, including WPML Multilingual CMS and String Translation, are updated to the latest versions. You can update these in the Plugins -> Add new -> Commercial tab. 2. Increase the WordPress memory limit to at least 256MB. This can be done by adding the following line to your wp-config.php file: define('WP_MEMORY_LIMIT', '256M'); Place this line just above the '/* That's all, stop editing! Happy publishing. */' line. 3. Depending on how your filters are constructed: - If based on categories, tags, or custom taxonomies: Translate these under WPML → Taxonomy Translation. - If based on custom fields: Set the translation preferences for these fields under WPML → Settings in the Custom Field Translation section. - If the filters involve strings from your theme or plugins: Use WPML → String Translation, and you might need to scan your theme or plugins for strings first under WPML → Theme and plugins localization. If these steps do not resolve the issue or if the solution seems outdated or not applicable to your case,"}
{"case_id": "e7758ceccbfa63fa", "topic_url": "https://wpml.org/forums/topic/url-is-automatically-changed-once-we-update-the-content-in-the-english-language-the-other-languages/#post-17603239", "text": "You are experiencing an issue where the URL automatically changes when you update content in the English language using WPML, and the URLs for other languages go missing.", "solution": "We have identified that you are already receiving assistance for this issue in other support tickets. To avoid duplication and ensure efficient resolution, we recommend continuing the discussion in your original support threads. You can find these threads here: https://wpml.org/forums/topic/once-we-update-the-content-the-url-on-the-other-languages-the-cpt-urls-specially-on-the-child-urls/ https://wpml.org/forums/topic/the-footer-template-is-not-getting-updated-the-subpage-urls-for-other-languages-are-not-working-an/ If this is a separate issue, please provide more details, ideally with screenshots, so we can better assist you."}
{"case_id": "78ad2684f39c409f", "topic_url": "https://wpml.org/forums/topic/wordcount-3/#post-17493089", "text": "The client needed to know how to find the word count for their site using WPML and also inquired about editing translations globally after using AI translation, specifically for handling incorrectly translated terms.", "solution": "We advised the client that when they are on the Translation Dashboard and select a page, they can see at the bottom the number of words that need to be translated, how many credits are used, and the exact price. Unfortunately, an estimate for the entire website is not currently available, but the client can check the estimated cost for each selected page or post. For editing translations globally, we recommended that from WPML > Settings, the client can choose to review the translation or set specific terms and their translations in the Glossary, which will then be used in automatic translations. More details on managing glossary entries can be found here: How to Create and Manage Glossary Entries ."}
{"case_id": "eb64aae83c0a0498", "topic_url": "https://wpml.org/forums/topic/mapping-a-supported-language-2/", "text": "Mapping a supported language The client was unable to map a language using the WPML plugin and encountered an error message when attempting to do so.", "solution": "1. Navigate to WPML → Languages and check if the desired language is listed. If not, add it by clicking Add / Remove languages . 2. If the language is listed but mapping causes an error, it might be due to missing or corrupted language data. Access WPML → Support and click on the Troubleshooting link. Use tools like Set language information and Fix element_type collation to fix language assignment issues. 3. Assign the correct language to content created while WPML was inactive using Set language information . 4. Check for JavaScript errors in your browser’s developer console on the WPML language setup page to identify any conflicts caused by themes or other plugins. 5. If the error persists, further assistance from our support team may be necessary. Please open a new support ticket for more specialized help. We also recommend checking related known issues at https://wpml.org/known-issues/ , verifying the version of the permanent fix, and confirming that you have installed the latest versions of themes and plugins."}
{"case_id": "f4d11ead25fcad2b", "topic_url": "https://wpml.org/forums/topic/i-cant-display-the-language-switcher-on-both-languages/#post-17534846", "text": "The client was unable to display the language switcher on both languages on their website using WPML.", "solution": "We resolved the issue by editing the Elementor's English header template. Initially, the incorrect menu was selected. We changed it to the correct menu: 'MainMenu - Czech', updated the template, and confirmed that the language switcher now displays correctly on the English version of the site."}
{"case_id": "711e8b68e15313ea", "topic_url": "https://wpml.org/forums/topic/scroll-to-anchor-id-is-not-working/#post-17488218", "text": "You are trying to translate a scroll to anchor link on your WordPress site using WPML, but when you translate the link, the anchor ID gets removed. This causes the page not to scroll to the intended ID.", "solution": "To ensure your translated links retain their anchor IDs, follow these steps: 1. Access the original page: Go to your WordPress admin and navigate to Pages . Find the original (English) page that contains the footer link you're trying to translate. 2. Open the translation in WPML Translation Editor: Next to the original page, you'll see language flags. Click the pencil icon for the French language to open the page in WPML's Translation Editor (ATE). 3. Locate and verify the anchor link: In the Translation Editor, search for the text of your link and ensure the anchor ID is correctly included in the translation."}
{"case_id": "0720f430d7f1cb97", "topic_url": "https://wpml.org/forums/topic/translate-h5p-activities-created-with-h5p-plugin/#post-17593447", "text": "You want to translate H5P activities on your WordPress site using the WPML plugin, but you cannot find how to do this because the H5P plugin is not compatible with WPML.", "solution": "Although the H5P plugin is not directly compatible with WPML, if your H5P activities are registered as a custom post type or custom taxonomy, you might still be able to translate them. Here’s how you can adjust the WPML settings: 1. For Custom Post Types: Go to: WPML → Settings → Post Types Translation and set the relevant post type to Translatable. 2. For Custom Taxonomies: Go to: WPML → Settings → Taxonomies Translation and set the taxonomy to Translatable. Please note that even with these settings, full compatibility is not guaranteed due to the lack of official integration from the plugin author."}
{"case_id": "e7f4f5ceb9595e21", "topic_url": "https://wpml.org/forums/topic/default-language-vs-redirect/#post-17542942", "text": "The client wants to set en-UK as the main language for syncing while keeping en-US as the default language for visitors on their WPML site.", "solution": "We recommend creating content in en-UK and translating it to other languages manually, as AI auto-translation only works from the default language to others. To ensure en-US remains the default language for visitors without browser language detection, activate the Browser Language Redirection option in WPML. This will redirect users whose browsers are set to a language not available on your site to the default language, en-US. If you need further assistance, please check related known issues at https://wpml.org/known-issues/ , verify the version of the permanent fix, and confirm that you have installed the latest versions of themes and plugins. If the solution provided here does not resolve your issue or seems outdated, we encourage you to open a new support ticket at WPML support forum . 0 4 1 month, 2 weeks ago Lucas Vidal de Andrade"}
{"case_id": "6e22b898ca4ad058", "topic_url": "https://wpml.org/forums/topic/fatal-error-wpml-multilingual-multicurrency-for-woocommerce-5-5-3/", "text": "fatal error WPML Multilingual & Multicurrency for WooCommerce 5.5.3 After updating to version 5.5.3, you are encountering a fatal error on the payment page when making a payment in a language different from the original. The error is related to the 'woo-stripe-payment' plugin where it fails to get the currency from an order object, which turns out to be false.", "solution": "If the issue persists, try disabling and re-enabling your theme, as this approach resolved the issue. Additionally, ensure that your theme and all plugins are updated to their latest versions."}
{"case_id": "3e6cc84722ad60b1", "topic_url": "https://wpml.org/forums/topic/wpml-doesnt-translate-my-logo/#post-17516698", "text": "The client is trying to ensure their logo appears on all language versions of their site using Astra and Elementor Pro. The logo only displays on the English version, and when attempting to set it for other languages via the WordPress Customizer, the logo field is unresponsive and cannot be edited.", "solution": "1. Confirm the logo is set in the Customizer’s header/logo section for the default language (English). 2. Switch the Customizer preview to another language using the language switcher in the top WordPress admin bar (e.g., select Danish). 3. Check if the logo field is filled for the secondary language. If it’s empty, select the same logo image as your default language and click Publish . 4. If the logo field is already filled for each language but still not showing, further troubleshooting might be needed to check for header template overrides or caching issues. This solution might be outdated or not applicable to your specific case. If the issue persists, we recommend checking related known issues at https://wpml.org/known-issues/ , verifying the version of the permanent fix, and confirming that you have installed the latest versions of themes and plugins. If needed, please open a new support ticket here . 0 12 1 month, 4 weeks ago Mihai Apetrei"}
{"case_id": "fd2474dffc6ca545", "topic_url": "https://wpml.org/forums/topic/media-translation-not-working-within-the-unlimited-element-carousel-widget/?paged=1", "text": "1 The client is experiencing issues with media translation not working within the Unlimited Element Carousel Widget using the WPML plugin. They are seeking a way to manage media names for different languages and ensure that the media translates correctly across different language versions of the site.", "solution": "1. Install and Activate WPML Media Translation: Ensure that the WPML Media Translation add-on is installed and activated. 2. Enable Automatic Media Text Translation: Go to WPML → Settings , scroll to the Media Translation section, and turn on 'Automatically detect best options for translating image texts'. 3. Translate the Page with the Carousel: Use the WPML Translation Dashboard to send the page containing the carousel for translation. 4. Replace Media in WPML Media Translation: Assign different images for each language by using the WPML Media Translation tool. 5. Re-save Your Elementor Page: After updating media translations, re-save the original page in Elementor to refresh content and apply new translation settings. If these steps do not resolve the issue, or if the solution seems outdated or not applicable to your specific case, we recommend opening a new support ticket. We also highly recommend checking related known issues at https://wpml.org/known-issues/ , verifying the version of the permanent fix, and confirming that you have installed the latest versions of themes and plugins. For further assistance, please visit our support forum at WPML Support Forum ."}
{"case_id": "1770dfd8ccf25de4", "topic_url": "https://wpml.org/forums/topic/applepay-googlepay-screens/", "text": "applepay & googlepay screens You are experiencing issues with the translation of popup screens for ApplePay and Google Pay after being transferred to the payment gateway. Despite following WPML guidance, you are unable to locate the strings in the admin.", "solution": "We have identified that the code for ApplePay and Google Pay is proprietary and loaded from an external server, which means it is not connected to WordPress and cannot be translated using standard WordPress methods. Since these services do not use getText() calls, which are essential for WPML to translate strings, the content remains untranslated. We recommend contacting Apple or Google directly to request that they include translations for their systems. This would ensure that the content is translated across different apps and CMS platforms, not just WordPress/WPML. However, based on Apple's explanation, which you can view here: https://support.apple.com/guide/iphone/change-wallet-apple-pay-settings-iphf8b1fc01e/ios , it seems unlikely that they will implement such an integration."}
{"case_id": "dc1e429f36d35a61", "topic_url": "https://wpml.org/forums/topic/rest-api-error-wpml-v4-8-4-your-site-doesnt-meet-wpmls-minimum-requirements/#post-17525383", "text": "After updating WPML to version 4.8.4 on a WordPress site, a warning appeared in the WPML panel stating 'Your site doesn’t meet WPML’s minimum requirements.' The client was concerned about the REST API status as the file structure in WPML seemed to have changed, affecting the way WPML checks the REST API status.", "solution": "We checked the client's website directly and confirmed that the REST API is functioning correctly by accessing https://aprendeastrologia.com/wp-json/wpml/st/v1 . The warning about WPML's minimum requirements was identified as a false negative, which can sometimes occur depending on the environment. Therefore, you can safely ignore this warning."}
{"case_id": "f01a04248e59ce18", "topic_url": "https://wpml.org/forums/topic/error-22/?paged=1", "text": "1 After a recent WPML update, you are unable to manually translate products in WooCommerce. When attempting to translate, you encounter an error stating 'The translator could not be assigned to the job,' and you are redirected to the 'translation queue' page instead of the product edit page.", "solution": "This issue is due to missing fields in the database table wp_icl_translate_job. To resolve this, please ensure you back up your entire server first for safety. Then, run the following database query to add the necessary fields: ALTER TABLE `wp_icl_translate_job` ADD `wpml_words_to_translate_count` int unsigned NULL, ADD `wpml_automatic_translation_costs` int unsigned NULL AFTER `wpml_words_to_translate_count`;"}
{"case_id": "f0351c82282a65d3", "topic_url": "https://wpml.org/forums/topic/split-clicked-on-synchronize-and-then-the-czech-variations-are-gone/", "text": "WPML Support Forum The client reported an issue where translated products did not display any product variations. This problem arose after attempting to translate products using XLIFF files and synchronizing taxonomies, which also led to the disappearance of variations in the default language.", "solution": "We advised the client to ensure that all global attributes are correctly translated, as missing translations in the secondary language can prevent variations from displaying correctly. The steps include: 1. Confirming that global attributes are used and translated. For guidance on translating global attributes, visit Translating Global Attributes . 2. Using the Advanced Translation Editor (ATE) to automatically translate attributes by assigning them to a test product and selecting automatic translation. This method is efficient as it does not incur charges for numerical values, only text. For more details, see How to Translate All Taxonomy Terms at Once and Advanced Translation Editor . If the solution provided does not resolve the issue or seems outdated,"}
{"case_id": "6626323c87938a36", "topic_url": "https://wpml.org/forums/topic/wpml-multilingual-multicurrency-for-woocommerce-not-recognized-as-installed/#post-17604086", "text": "The client manually installed the WPML Multilingual & Multicurrency for WooCommerce plugin, which is updated to version 5.5.3. However, the plugin appears as 'Not installed' in WPML and the WordPress support panel, causing issues with product variation translations and missing WPML features like the 'Multilingual e-commerce' menu.", "solution": "We recommend deactivating all plugins except for WPML to check for conflicts. This should be done in small batches, about 10 at a time, to ensure that any settings causing the issue are reset. After deactivating and reactivating, the variations should appear as expected. It is crucial to always have a backup before performing these steps. Additionally, always clear all caches after publishing a product and its translations to prevent similar issues. If the problem persists, please visit our support forum at https://wpml.org/forums/ for further assistance."}
{"case_id": "46a233015d1ca38f", "topic_url": "https://wpml.org/forums/topic/password-account-access-issue/", "text": "Password / Account access issue If you're experiencing an issue where your WPML account shows a message that your email does not have a usable password and your account might have been reset, even though you did not initiate any reset, follow the steps below for a solution.", "solution": "1. Disconnect any social media accounts linked to your WPML profile. 2. Log out of your WPML account. 3. Visit https://wpml.org/account and click the Login button. 4. Use the 'Forgot password' option to generate a new password. After completing these steps, you should be able to log in with your email and new password, and you can change the password later if needed."}
{"case_id": "33f90fb7a472e08b", "topic_url": "https://wpml.org/forums/topic/random-pages-of-my-site-are-opening-the-clasic-editor-instead-of-ate-follow-up-solution-did-not-w/", "text": "Random pages of my site are opening the clasic editor instead of ATE (follow up – solution did not w... You are experiencing an issue where random pages on your WordPress site open with the WordPress editor instead of the Advanced Translation Editor (ATE) despite correct settings.", "solution": "1. Open the page (in the default language) in your WordPress editor. 2. In the right-hand sidebar, find the Language section. 3. Check which translation editor is selected. If it says 'WordPress Editor', click to change it to WPML editor . 4. When prompted, choose whether to use the WPML (Advanced) Translation Editor for just this page or for all pages of this type. Pick the option that fits your workflow. 5. Save or update the page. After updating, go back to WPML → Pages (or the relevant translation dashboard) and click the plus icon for translation. The ATE should now open as expected. To prevent this from happening on other pages, you can set your preferred editor for all content types in WPML → Settings → Translation Editor . This ensures ATE is used by default for future translations. If you still see some pages opening the WordPress editor after these steps, double-check each affected page's Language settings as above."}
{"case_id": "e2962f536730eddb", "topic_url": "https://wpml.org/forums/topic/is-not-taking-the-translation-in-my-page/#post-17487308", "text": "You are trying to translate a description taxonomy on your WordPress site using WPML, but the translation is not appearing on the frontend.", "solution": "We recommend checking the WPML settings to ensure that the “Adjust IDs for multilingual functionality” option is enabled. This setting is crucial for the theme to function correctly. You can enable this option by navigating to WPML >> Languages. Once enabled, this should resolve the issue with the translation not appearing on the frontend."}
{"case_id": "ebc1ae25c97e3fff", "topic_url": "https://wpml.org/forums/topic/cant-delete-categories-translated-by-wpml/", "text": "Can’t delete categories translated by wpml The client is unable to delete a category translated by WPML. The deletion action from the WordPress categories screen has no effect, with no visible error but the action is blocked.", "solution": "1. Manage category deletion via WPML’s Taxonomy Translation interface. 2. Clear all translations of the category by emptying the translation fields in each language and saving. 3. Attempt deletion again via Posts → Categories after clearing translations. 4. If the issue persists, activate WordPress debug mode as described in Debugging in WordPress and check for JS/PHP errors in the browser console or error logs during deletion. 5. If no errors are found, test for plugin/theme conflicts, preferably in a staging environment. If these steps do not resolve the issue, or if the problem seems complex, please do not hesitate to open a new support ticket. We also highly recommend checking related known issues at https://wpml.org/known-issues/ , verifying the version of the permanent fix, and confirming that you have installed the latest versions of themes and plugins."}
{"case_id": "436cb5edd442a775", "topic_url": "https://wpml.org/forums/topic/ate-translations-not-applied-status/", "text": "ATE translations not applied – status You are trying to create new translations or update existing translations of pages and products via WPML Advanced Translation Editor (ATE). After completing the translation in ATE, the translation should automatically apply, and the status should change to 'Complete' in WPML Translation Management. However, the translated page/product is not created or updated in the target language, and the status changes to 'assigned to local translator'. The translation is saved in ATE but is not applied to the WordPress site, and no translated page is visible on the site frontend.", "solution": "The issue was due to a mismatch between the website id on your site for the Advanced Translator Editor and the one in our system, likely caused by a problem during migration. We have manually corrected this mismatch, and now the translations should complete as expected."}
{"case_id": "417c8a97c6695af6", "topic_url": "https://wpml.org/forums/topic/wpml-multilingual-cms-has-axios-library-with-vulnerability/", "text": "WPML Multilingual CMS has Axios library with vulnerability You are concerned about the axios library version 1.7.2 used on your site due to its known high vulnerability.", "solution": "We have confirmed that Axios v1.7.2 is only used within admin-only WPML UI modules and is not exposed on the public front end, ensuring there is no security risk for site visitors. An update is planned in the upcoming minor release (4.8.5), which is expected to include a patch for this issue. While we do not have an exact release date, it should be available soon based on past release patterns. If this solution becomes irrelevant due to being outdated or not applicable to your case, we recommend opening a new support ticket. We also highly recommend checking related known issues at https://wpml.org/known-issues/ , verifying the version of the permanent fix, and confirming that you have installed the latest versions of themes and plugins. For further assistance, please visit our support forum at WPML Support Forum ."}
{"case_id": "264702f94ff3f9a5", "topic_url": "https://wpml.org/forums/topic/since-today-the-site-is-missing-the-logo-except-for-the-english-original/?paged=2#post-17492986", "text": "The client reported that the logo was missing on translated pages of their website, showing only on the original English page. Instead of the logo, a placeholder appeared.", "solution": "We updated WPML to version 4.8.3 on the client's staging site.To resolve the issue, we navigated to WPML → Settings → Media Translation, deactivated the 'Automatically detect best options for translating image texts' option, ran the duplication of existing images across languages, and then reactivated the automatic option."}
{"case_id": "a1a632044eb4b2fd", "topic_url": "https://wpml.org/forums/topic/split-footer-design-is-not-copied-over-to-translations/", "text": "Split: Footer design is not copied over to translations The client is unable to see the updated footer in the German and French versions of their website. The footer, which is a global Divi element, displays an outdated version with a light background instead of the new dark background version that appears on the English page.", "solution": "If you're experiencing issues with global Divi elements not updating on translated pages, we recommend translating these elements from the WPML > Translation Dashboard. Here's how you can do it: 1. Navigate to WPML > Translation Dashboard. 2. Select the global elements such as the footer and send them to translation. 3. Choose \"Translate myself\" and then proceed to WPML > Translations to complete the translations. This approach should ensure that all global elements display correctly in all languages."}
{"case_id": "794f2e3225c63c0e", "topic_url": "https://wpml.org/forums/topic/split-jobs-wont-load/?paged=2", "text": "2 After deleting and re-adding a user, the client found that translations were visible, but upon opening the first form to translate, it did not function correctly.", "solution": "We recommend following these steps to resolve the issue: 1. Open your database administration tool (such as PhpMyAdmin). 2. Execute the following SQL commands: UPDATE `{wpdbPrefix}_icl_translation_status` SET `status` = 1 WHERE `status` = 2 UPDATE `{wpdbPrefix}_icl_translation_status` SET `status` = 10 WHERE `status` = 1; UPDATE `{wpdbPrefix}_icl_translation_status` SET `status` = 10 WHERE `status` = 9; Make sure to replace '{wpdbPrefix}' with your actual table prefix."}
{"case_id": "7f3e342800622eb9", "topic_url": "https://wpml.org/forums/topic/wpml-woocommerce-additional-variation-images-and-swatches-pro/#post-17591341", "text": "You are using WPML with WooCommerce Additional Variation Images And Swatches PRO, and your products have variations where each variation has its own gallery. If a product variation has more than 5 photos, the product crashes and content disappears. This issue resolves when disabling WPML plugins.", "solution": "If you're experiencing this issue, we recommend you try the following steps to help us identify the exact error causing the problem: 1. Delete the current debug.log file on your site. 2. Reproduce the issue. 3. Share the new debug.log file with us for review. This process will help pinpoint the specific error causing your product to crash when there are more than 5 photos in a variation gallery."}
{"case_id": "d530745badd2d3cb", "topic_url": "https://wpml.org/forums/topic/updating-affected-posts-for-changes-in-translatable-fields-is-stuck-on-a-custom-field/?paged=3", "text": "3 The client is experiencing an issue where the process of updating affected posts for changes in translatable fields is stuck on the 'custom_title' custom field after updating WPML and String Translations plugins. The process is halted at 50 entries and does not progress despite retries.", "solution": "1. Ensure that all WPML plugins are updated to their latest versions. 2. Backup the entire site. 3. Run all troubleshooting options available under WPML > Support > Troubleshooting, except for those that involve resetting. 4. If the issue persists, consider truncating the 'icl_background_tasks' table and re-uploading the initial database before updates. 5. Check server and PHP configurations, as discrepancies in these settings across different environments might contribute to the issue. 6. If none of the above steps resolve the issue, we recommend opening a new support ticket. Additionally, it's advisable to check related known issues at https://wpml.org/known-issues/ , verify the version of the permanent fix, and confirm that you have installed the latest versions of themes and plugins. If these steps do not resolve your issue, please do not hesitate to contact us for further assistance by opening a new support ticket at WPML support forum ."}
{"case_id": "80b2fbb68b05d10f", "topic_url": "https://wpml.org/forums/topic/header-garbled-on-translated-pages-since-wpml-update/", "text": "Header garbled on translated pages since WPML update After updating the WPML plugin, the client noticed that while the English pages (original language) look fine, the translated pages have issues where the header logo is missing and the menu is not formatted correctly.", "solution": "We have received similar reports about this issue. Our development team is aware and a fix is planned for an upcoming release. In the meantime, if you're experiencing this issue, we recommend checking our known issues page and verifying if there's a temporary workaround or patch available. Additionally, ensure that you have the latest versions of all themes and plugins installed."}
{"case_id": "ec16ab70d9c5e439", "topic_url": "https://wpml.org/forums/topic/i-am-facing-an-issue-with-language-redirection-on-my-wordpress-website/#post-17523109", "text": "You are trying to display the English version of a custom taxonomy on your WordPress site, but WPML keeps redirecting it to the Urdu version, even though the taxonomy term only exists in English.", "solution": "The issue is caused by a redirect set by the Yoast SEO Premium plugin. To resolve this, navigate to Yoast SEO >> Redirects and delete the problematic redirect. After removing the redirect, ensure to clear all types of cache (site/server/CDN) to see if the issue is resolved."}
{"case_id": "2c8a9cb99e1e7569", "topic_url": "https://wpml.org/forums/topic/reassigning-credits-to-our-staging-site-now-otgs-cannot-be-re-activated/", "text": "Reassigning credits to our staging site – now OTGS cannot be re activated The client was unable to reactivate OTGS on their new development site (staging25) and reallocate translation credits from an old deactivated site (staging10). Despite re-registering the site and updating to the latest version of OTGS, the site remained inactive and the credits could not be reassigned.", "solution": "1. We guided the client to manually upload and reactivate the OTGS Installer plugin, which resolved the activation issue. 2. We instructed the client to verify that the 1010 credits from the deactivated staging10 returned to their WPML.org account. 3. We outlined the standard process to reassign credits using the WPML account dashboard to assign credits to staging25 and verify through WPML plugin’s Translation Dashboard. 4. Despite these steps, the client was unable to reassign credits due to an unspecified error message in French. We recommended reviewing the client’s WPML.org account backend for credit allocation discrepancies and investigating any localized error messages."}
{"case_id": "73a3308bde95e866", "topic_url": "https://wpml.org/forums/topic/translation-of-media-grid-wpbakery/", "text": "Translation of Media Grid (WPBakery) If you're experiencing issues with the WP Bakery Media Grid Widget not working on translated pages in second languages, and this occurs on every page that has a media grid, the issue might be related to how the media grid is translated.", "solution": "We recommend using the WPML Translation Editor to translate your pages as it handles the translation of media grids more effectively. However, if you prefer using the WordPress Editor, follow these steps: 1. Navigate to WPML > Settings > Custom Field Translation and click on \"Show system fields\". 2. Search for the field _vc_post_settings and change its setting to \"Not translate\". 3. Save your changes and re-translate the pages using the WordPress Editor. This adjustment is necessary because the field _vc_post_settings , which includes image IDs, needs specific handling to ensure images display correctly across different languages when not using the WPML Translation Editor."}
{"case_id": "bed5779a763aa32f", "topic_url": "https://wpml.org/forums/topic/split-variation-shortcode/", "text": "Split: variation shortcode The client reported an issue where the table displaying product variations was empty on the German version of a product page, despite having translated all attributes and product details.", "solution": "1. We verified the use of a shortcode [varianty id=\"4658\"] to display product variations and inquired about its origin, whether it was custom code or from a third-party plugin. 2. We made adjustments to the default language settings, saved them, and then re-translated the content to 100%, which resolved the issue of the missing data in the second language. 3. We recommended setting products, variations, and each created attribute to translatable via WPML > Settings. 4. The client was advised to update to WCML 5.5.2.2, translate attributes through WPML > Taxonomy Translation, and update products in the default language. 5. Products should be sent for translation via WPML > Translation Dashboard, and XLIFFs exported, re-translated, and then uploaded. 6. It was noted that the same XLIFF exported for the current translation job should be used for re-import to ensure WPML recognizes it."}
{"case_id": "6081a031e0cd5239", "topic_url": "https://wpml.org/forums/topic/product-category-does-not-get-translated-to-nl-de-links-fail/?paged=1", "text": "1 The client reported that after a recent update, the product-category links were not translating to Dutch (NL) and German (DE), resulting in 'Not Found' errors across the site's top menu and internal links. Despite various troubleshooting steps, including verifying taxonomy slug translation, enabling base slug translations, and clearing caches, the issue persisted.", "solution": "We accessed the client's staging site and discovered that the product category slug for Dutch was incorrectly set to 'product-categoriex'. We advised the client to update the product category slug in WooCommerce -> WPML Multilingual & Multicurrency for WooCommerce -> Store URLs tab -> Product category base. After updating the translation of the product category slug and re-saving the permalinks, the issue was resolved. Additionally, we ran a troubleshooting step in the WPML -> Support -> 'troubleshooting' link to address a problem in the language table on the database."}
{"case_id": "29fc015c924da8bb", "topic_url": "https://wpml.org/forums/topic/media-translation-not-working-within-the-unlimited-element-carousel-widget/?paged=4#post-17652389", "text": "The client is experiencing issues with media translation not working within the Unlimited Element Carousel Widget using the WPML plugin. They are seeking a way to manage media names for different languages and ensure that the media translates correctly across different language versions of the site.", "solution": "1. Install and Activate WPML Media Translation: Ensure that the WPML Media Translation add-on is installed and activated. 2. Enable Automatic Media Text Translation: Go to WPML → Settings , scroll to the Media Translation section, and turn on 'Automatically detect best options for translating image texts'. 3. Translate the Page with the Carousel: Use the WPML Translation Dashboard to send the page containing the carousel for translation. 4. Replace Media in WPML Media Translation: Assign different images for each language by using the WPML Media Translation tool. 5. Re-save Your Elementor Page: After updating media translations, re-save the original page in Elementor to refresh content and apply new translation settings. If these steps do not resolve the issue, or if the solution seems outdated or not applicable to your specific case, we recommend opening a new support ticket. We also highly recommend checking related known issues at https://wpml.org/known-issues/ , verifying the version of the permanent fix, and confirming that you have installed the latest versions of themes and plugins. For further assistance, please visit our support forum at WPML Support Forum . 0 50 1 week, 5 days ago sachaJ"}
{"case_id": "e135582500481b07", "topic_url": "https://wpml.org/forums/topic/upgrade-error/", "text": "Upgrade error If you're experiencing a critical error during the update of your WordPress site using the WPML plugin, specifically a database error indicating a 'Duplicate column name', this might be due to an issue with the update process.", "solution": "We recommend testing a manual update of your WPML plugins. This approach can help bypass the issue causing the duplicate column error. You can find a detailed guide on how to perform a manual update here: Updating WPML manually ."}
{"case_id": "769216b6b6d8d812", "topic_url": "https://wpml.org/forums/topic/content-control-plugin/#post-17531233", "text": "The client is using the 'Content Control' plugin by 'Code Atlantic' for WordPress, which allows setting a 'Custom Redirect URL' under 'Protection' in the 'Restriction' settings. However, the plugin does not support language-specific options for the 'Custom Redirect URL'.", "solution": "We recommend creating separate restrictions for each language. For instance, set up one restriction with a custom redirect URL for English pages and another for German pages. This approach allows the 'Custom Redirect URL' to adapt based on the current WPML language."}
{"case_id": "edec77095b757e52", "topic_url": "https://wpml.org/forums/topic/menu-navigation-sidebar-cannot-be-translated/", "text": "menu navigation sidebar cannot be translated The client is experiencing issues with translating the menu navigation sidebar, Professional Service sidebar, Timing sidebar, and the appointment form at the bottom of each page, which appears in English on some pages and in Arabic on others.", "solution": "If you're facing similar issues with sidebar translations or inconsistent language displays in forms, we recommend the following steps: 1. Navigate to WPML > Settings and set the ElementsKit items post type to be translatable. 2. Go to WPML > Translation Dashboard and locate the widget to translate, as indicated in our provided screenshot."}
{"case_id": "ff3cb6bc63e106e0", "topic_url": "https://wpml.org/forums/topic/i-have-translated-some-images-but-some-are-not-working-correctly/", "text": "I have translated some images, but some are not working correctly. The client is using WPML to translate images for different languages on their website. Some translated images are not displaying correctly across various language versions of the site.", "solution": "We visited the page provided by the client and confirmed that the images are displaying correctly. If you're experiencing this issue, we recommend trying the following steps: 1. Clear your browser's cache. 2. Try accessing your site in incognito mode. 3. Use a different browser to see if the issue persists. 4. Sent the page to translate again. If these steps do not resolve the issue, it might be because the solution is outdated or not applicable to your specific case."}
{"case_id": "077fd00bf8e303b1", "topic_url": "https://wpml.org/forums/topic/connection-error-please-wait-a-minute-and-reload-this-page-if-the-problem-continues-please-contac-2/#post-17512106", "text": "The client was experiencing a 'Connection Error. Please wait a minute and reload this page. If the problem continues, please contact WPML support.' error while trying to translate pages on their website using WPML.", "solution": "We redefined the AI Engine and performed some default troubleshooting steps, which resolved the error. We asked the client to verify if the error persists. If it does, we suggested trying to send the content for translation regardless and to inform us if the issue continues."}
{"case_id": "1a38b63de1619f30", "topic_url": "https://wpml.org/forums/topic/split-jobs-wont-load/?paged=3", "text": "3 After deleting and re-adding a user, the client found that translations were visible, but upon opening the first form to translate, it did not function correctly.", "solution": "We recommend following these steps to resolve the issue: 1. Open your database administration tool (such as PhpMyAdmin). 2. Execute the following SQL commands: UPDATE `{wpdbPrefix}_icl_translation_status` SET `status` = 1 WHERE `status` = 2 UPDATE `{wpdbPrefix}_icl_translation_status` SET `status` = 10 WHERE `status` = 1; UPDATE `{wpdbPrefix}_icl_translation_status` SET `status` = 10 WHERE `status` = 9; Make sure to replace '{wpdbPrefix}' with your actual table prefix."}
{"case_id": "f0f49eec8ec8e136", "topic_url": "https://wpml.org/forums/topic/what-is-the-status-of-my-support-request-i-dont-see-anything/?paged=1", "text": "1 The client was experiencing issues with various widgets of Unlimited Elements for Elementor, where the Media Translation did not replace the images in a second language. This was particularly problematic with the 'Coverflow Carousel' and 'Dual Color Heading' widgets from Unlimited Elements for Elementor, which were not filtering images correctly by language.", "solution": "We first recommended ensuring all plugins were updated and then re-saving the original page in Elementor. When this did not resolve the issue, we identified that the function getUrlAttachmentImage in the plugin was not checking for the current language. We provided a code snippet to modify this function to integrate WPML's language settings: For the Image Carousel, revise this comment . Another fix can be found here . We advised the client to report these details to the plugin authors and informed them that our compatibility team would also reach out to the plugin authors."}
{"case_id": "b27e4956ad0e3990", "topic_url": "https://wpml.org/forums/topic/deregister-and-register-subsites-on-multisite-fix-bug-after-database-tables-optimization/#post-17589953", "text": "The client is experiencing issues with their WordPress multisite after migrating to another domain. Specifically, they cannot update the WPML license for individual sites within the multisite network, encounter database breakdowns during table optimization, and see old links in translation fields post-migration.", "solution": "We recommend updating your WPML plugins to the latest version, which includes fixes for the issues mentioned. Here's how you can update your plugins: 1. Navigate to Plugins → Add New Plugin . 2. Click on the Commercial tab. 3. Click the \"Check for updates\" button. https://wpml.org/wp-content/uploads/2020/04/wpml-force-plugin-update-1.png Please ensure to create a backup of your site before updating as a precaution."}
{"case_id": "311685ab47432566", "topic_url": "https://wpml.org/forums/topic/invoice-5/#post-17606745", "text": "You are trying to translate a string from a HubSpot Form on your website, but the string does not appear for translation, and the ID of the HubSpot form is missing.", "solution": "First, ensure that you have followed all the steps outlined in our documentation on integrating HubSpot with multilingual sites that use WPML. You can find the guide here: Integrating HubSpot with WPML . If after completing these steps the issue persists, we recommend providing us with temporary access (wp-admin and FTP) to a staging site where the problem can be replicated. This will allow us to investigate further."}
{"case_id": "97681ded573748cb", "topic_url": "https://wpml.org/forums/topic/jetengine-meta-fields-not-displaying/#post-17530622", "text": "If you're experiencing issues with translating Custom Post Types (CPT) and their associated meta fields using JetEngine and WPML, where the meta fields do not appear as editable options within the translation screen, follow the steps below.", "solution": "1. Confirm that you have set your translation preferences correctly by navigating to WPML → Settings. Ensure you have the following sections configured: - Post Types Translation – Set Listings, Components, Post Types, etc., to Translatable. - Custom Fields Translation – Set Meta Boxes, Meta Fields, etc., to Translate. If the fields handle settings that do not need a translation, set them to \"Copy\". - Taxonomies Translation – Set Custom Taxonomies, etc., to Translatable. Save these settings. 2. Edit one of the original post types, save it, and then open the translation editor. You should now see the metafields in the Advanced Translation Editor. For detailed guidance, visit How to Translate JetEngine with WPML . 3. If the metafields are still not translatable, go to WPML > Settings > Custom Field Translation and set each related field to \"Translate\". After setting, edit and save one of the affected original posts, then update the translation. For more information, check Translating Custom Fields . 4. If issues persist, we recommend backing up your website and providing temporary admin access for further investigation."}
{"case_id": "ce790e86c434cafc", "topic_url": "https://wpml.org/forums/topic/i-just-need-informations-about-wpml-compatibility-and-php-8-4/", "text": "I just need informations about WPML compatibility and PHP 8.4 You are experiencing random slowness on your website and have noticed several deprecated notifications related to WPML and other plugins. You are concerned these might be linked to the performance issues.", "solution": "Deprecated notifications typically do not cause website slowness. Since WordPress does not fully support PHP 8.4 yet, neither does WPML, but this should not lead to performance issues. We recommend setting up a staging site and sequentially disabling plugins and themes, leaving only WPML active, to identify any potential conflicts or issues causing the slowness. If the problem persists, we suggest you open a new support ticket so we can assist you further."}
{"case_id": "f649770a85094d1c", "topic_url": "https://wpml.org/forums/topic/please-reset-the-advanced-translation-editor-ate-communication/?paged=1", "text": "1 The client was experiencing issues with 'Jobs could not be loaded' and cURL 28 timeouts after trying to reset the Advanced Translation Editor (ATE) communication record and reinstalling WPML Translation Management.", "solution": "1. **Increase WP Memory Limit**: Access the site's wp-config.php file and add or update the line: define('WP_MEMORY_LIMIT', '256M'); to ensure sufficient memory for WordPress and WPML operations. 2. **Cancel Stuck Translation Jobs**: Navigate to **WPML → Translation Dashboard**, switch to the **Jobs** tab, select any jobs showing errors, and click **Cancel selected jobs**. Make a minor edit to the content and resend for translation. If these steps do not resolve the issue or if the problem persists, it might be due to outdated solutions or specific circumstances not covered here. We recommend visiting https://wpml.org/known-issues/ to check for any related known issues, verify the version of the permanent fix, and confirm that you have installed the latest versions of themes and plugins. If the problem continues, please open a new support ticket with us for further assistance."}
{"case_id": "612884b33405c444", "topic_url": "https://wpml.org/forums/topic/translating-text-content-in-filterable-gallery-widget-from-essential-addon-for-elementor/#post-17617042", "text": "The client was unable to see the content in the text editor box inside the widget in the Advanced Translation Editor (ATE) when using WPML to translate the Filterable Gallery widget from the Essential Addon for Elementor.", "solution": "We identified an incorrect field definition in the WPML configuration XML. The client initially had <field>link>url</field> , which was incorrect. Changing this to <field type=\"Heading Link\" editor_type=\"LINK\">link>url</field> resolved the issue. Additionally, we suggested setting the editor_type to \"LINE\" for fields in the WPML config that are used with the Advanced Translation Editor, as the default is \"LINE\" and the only field set to \"VISUAL\" might not display correctly."}
{"case_id": "48e511ddb21ef02d", "topic_url": "https://wpml.org/forums/topic/on-some-instances-my-translation-fields-are-being-copied-multiple-times-2/#post-17520215", "text": "If you're experiencing issues with duplicated translation fields in the WPML Advanced Translation Editor (ATE) when using ACF Flexible Content, where every sentence becomes a separate field, cluttering the editor, this might be due to orphaned postmeta records left from previously deleted ACF field groups.", "solution": "We recommend checking for orphaned `postmeta` entries in your database that are no longer tied to active ACF field definitions. These orphaned entries are treated as generic custom fields by ATE, leading to duplication in the translation editor. To resolve this, consider using tools like Advanced Database Cleaner or WP-Sweep to safely remove these unused postmeta entries. Ensure you take a full database backup before performing any cleanup to avoid data loss."}
{"case_id": "8ef6d125a60decca", "topic_url": "https://wpml.org/forums/topic/found-a-bug-for-wordpress-admin/#post-17598650", "text": "The client was unable to access the WP admin plugins list due to a fatal error caused by WPML returning incorrect placeholders for the printf function. The error message indicated that '4 arguments are required, 2 given' in a specific PHP file.", "solution": "We recommended the client to first check if any custom functions might be affecting the site. Next, we suggested deactivating the WPML String Translation plugin temporarily to see if the issue persists. If the problem is resolved by deactivating the plugin, the client should then: 1. Reactivate WPML String Translation. 2. Navigate to WPML → String Translation. 3. Search for strings containing placeholders like %s and ensure the translated versions also include the correct placeholders. It's crucial to update WPML core to version 4.8.5 and all add-ons to their latest versions, which can be downloaded from https://wpml.org/account/downloads/ . We also advised backing up the database before making any changes."}
{"case_id": "68c44b0df2334a2a", "topic_url": "https://wpml.org/forums/topic/custom-taxonomy-filter-not-working/#post-17491046", "text": "The client is experiencing an issue where the translation of certain elements on the Projects page is not working correctly. Specifically, the buttons using a custom taxonomy (\"proj_status\") to filter a list of custom posts (\"project\") are not translating correctly in some languages, showing both translated and English versions.", "solution": "We checked the shortcode [eb5capital_projects] used for displaying the filters. We then configured the option in WPML > Settings > Taxonomies Translation > Status (proj_status) > Translatable - only show translated items. This adjustment resolved the issue."}
{"case_id": "296c07741321f49d", "topic_url": "https://wpml.org/forums/topic/content-adaptation/#post-17504342", "text": "You are transitioning to handling development internally and want to assign each country domain its own language without duplicating the site. You also need to automate country-specific legal and currency adaptations across 600 pages.", "solution": "If you're experiencing issues with assigning different languages to each country domain without duplicating content, we recommend upgrading from the WPML All Import to the newer WPML Export and Import plugin. This newer version supports various import methods that can facilitate managing translations and content adaptations more efficiently."}
{"case_id": "b43fec810ec67bca", "topic_url": "https://wpml.org/forums/topic/translate-full-automatic/", "text": "translate Full automatic You have activated full automatic translation using WPML and noticed that the entire design of your website is destroyed.", "solution": "We have reviewed your issue and it appears that the automatic translation feature does not affect the primary language, and therefore, should not cause any issues with your website's design. It is likely that the problem you are experiencing is related to caching. We recommend that you clear all caches on your website and check the page again using a different browser or device to see if the issue persists."}
{"case_id": "3b16001833f89976", "topic_url": "https://wpml.org/forums/topic/some-texts-and-strings-i-can-not-able-to-translate/#post-17656718", "text": "The client was unable to translate certain texts and strings on their website using WPML.", "solution": "We recommended several steps to make the strings translatable: 1. Enable auto-detection in WPML → String Translation and visit the front-end in a non-default language to help WPML detect and register the strings. 2. If strings are still missing, use WPML → String Translation → Utilities → Admin Texts Translation to find and select strings from theme or plugin options for translation. 3. If strings are not found in Admin Texts, scan the theme or plugin directly from WPML → Theme and plugin localization . 4. Check WPML → Translation Dashboard under Templates or Template Part sections for embedded strings in theme parts. If these steps do not resolve the issue, it might be due to strings being hardcoded in theme/template files or using non-WPML-compatible functions. In such cases, a manual inspection of the texts and their page sources is necessary. We recommend not repeating previously confirmed ineffective steps and considering alternate methods like registering text via WPML hooks or direct gettext review. If the solution provided here is outdated or not applicable to your case,"}
{"case_id": "bc63de7f8e657738", "topic_url": "https://wpml.org/forums/topic/update-cause-fatal-error/", "text": "Update cause fatal error You are experiencing a fatal error after attempting to update WPML Multilingual CMS & WPML String Translation. The error logs indicate a PHP Fatal error due to 'Too few arguments to function WPML_ST_Slug_Translations::__construct()'.", "solution": "We recommend creating a full backup of your site before proceeding with any further actions. The likely cause of the fatal error is that not all plugin files were copied correctly during the update. If the error persists after checking and ensuring all files are correctly updated, please contact us for further assistance. We may need to request access to your site to investigate further and identify the exact cause."}
{"case_id": "a956f9ae5fddf2d8", "topic_url": "https://wpml.org/forums/topic/learndash-translations-are-not-working/?paged=1", "text": "1 The client was unable to see the translated LearnDash module content in English on their website. Despite translating everything, the English version displayed no content.", "solution": "1. Ensure that the Elementor template is properly translated and switch to the WordPress editor before saving the template. 2. For LearnDash contents, verify that the 'WordPress Editor' option is correctly set as per the guide on using different translation editors for different pages. You can find the guide here: Using Different Translation Editors for Different Pages . 3. In Elementor's settings, disable Elementor for the courses and their contents, update the original courses, and then update the translations. 4. Translate LearnDash content only with the WordPress Editor, not with the WPML Translation Editor. If these steps do not resolve your issue, or if the solution seems outdated or not applicable to your case,"}
{"case_id": "02b706aca27207d3", "topic_url": "https://wpml.org/forums/topic/woocommerce-product-filters-dont-work-with-wpml/#post-17498681", "text": "You are trying to create product filters using the WooCommerce Product Filters by Barn2 plugins for both English and Dutch pages on your site. While the Dutch page filter works fine using the shortcode [product_filters id=\"1\" layout=\"vertical\"] , the English page filter using the shortcode [product_filters id=\"4\" layout=\"vertical\"] does not work and shows a rotating loader icon without loading the filters.", "solution": "We have identified that the filters work correctly in the primary language with specific parameters in the Filter Group widget or shortcode. However, the filters are not fully compatible with WPML in the secondary language, which is a known limitation of the plugin. This issue arises particularly with attribute filters not displaying options correctly across all languages. We recommend two potential solutions: 1. Contact Barn2 to submit a feature request for full WPML integration, which could resolve this issue in a future update. You can submit your request here: https://barn2.com/support-center/plugin-feature-request/ 2. Consider switching to a plugin that is already fully compatible with WPML, such as Annasta WooCommerce Product Filters. More information can be found here: https://wpml.org/plugin/annasta-woocommerce-product-filters"}
{"case_id": "2aa57209d2d7aa87", "topic_url": "https://wpml.org/forums/topic/how-we-can-show-language-switcher-on-menu-using-shortcode-3/", "text": "how we can show language switcher on menu using shortcode You are trying to display a language switcher on the menu using a shortcode.", "solution": "If you're experiencing this, we recommend you follow these steps: 1. Navigate to WPML → Languages. 2. Enable the option 'Custom Language Switchers'. 3. Use the shortcode [wpml_language_selector_widget] to display the language switcher wherever you need it. You can also customize the appearance and behavior of the shortcode switcher under WPML → Languages → Custom Language Switchers. For more details, visit Adding Language Switchers using PHP and Shortcodes ."}
{"case_id": "27599d717a4e46b9", "topic_url": "https://wpml.org/forums/topic/http-error-500-when-i-try-to-open-wpml-%e2%86%92-wp-menu-sync/#post-17584356", "text": "The client was experiencing issues with the WPML plugin on their website. Specifically, the language switcher was not appearing on the English version of the site, and accessing WPML → WP Menu Sync or editing any translated page with Elementor resulted in an HTTP 500 error.", "solution": "We recommended conducting a minimal environment test to isolate the issue. The steps included deactivating all plugins except WPML CMS, switching to a default WordPress theme, and then accessing WPML → WP Menu Sync. The client discovered that the 'Docket Cache' plugin was causing the issue. Upon deactivating Docket Cache, both the language switcher and WP Menu Sync functioned correctly without triggering the HTTP 500 error. The client decided to keep Docket Cache deactivated to continue working without interruptions."}
{"case_id": "e4f7ec8eec683fd8", "topic_url": "https://wpml.org/forums/topic/reassigning-credits-to-our-staging-site-now-otgs-cannot-be-re-activated/?paged=2", "text": "2 The client was unable to reactivate OTGS on their new development site (staging25) and reallocate translation credits from an old deactivated site (staging10). Despite re-registering the site and updating to the latest version of OTGS, the site remained inactive and the credits could not be reassigned.", "solution": "1. We guided the client to manually upload and reactivate the OTGS Installer plugin, which resolved the activation issue. 2. We instructed the client to verify that the 1010 credits from the deactivated staging10 returned to their WPML.org account. 3. We outlined the standard process to reassign credits using the WPML account dashboard to assign credits to staging25 and verify through WPML plugin’s Translation Dashboard. 4. Despite these steps, the client was unable to reassign credits due to an unspecified error message in French. We recommended reviewing the client’s WPML.org account backend for credit allocation discrepancies and investigating any localized error messages."}
{"case_id": "b953aa98f43b58ca", "topic_url": "https://wpml.org/forums/topic/split-i-cant-chamnge-password/", "text": "Split: I cant chamńge password The client is unable to change their password.", "solution": "We recommend providing more details about the issue you are encountering. Sometimes, screenshots can help clarify the problem where words might fail. Please use the \"upload an image\" feature below the comment area to provide visual context."}
{"case_id": "d66cec3da7e44ea1", "topic_url": "https://wpml.org/forums/topic/split-galleries-are-completely-different-even-though-the-back-end-shows-the-same/#post-17619089", "text": "The client reported that product galleries were not syncing correctly between different language versions of their website, despite the backend showing the same settings for both.", "solution": "We recommended the client to first check if the issue persists with newly created products to determine if it's a recurring problem. We also suggested deactivating all other plugins except WPML and WooCommerce to rule out any plugin conflicts. Additionally, making a minor change to the original product, updating it, and then re-translating could help resolve the issue. If these steps do not solve the problem, it might be outdated or not applicable to your specific case."}
{"case_id": "09ed11380f2c5af6", "topic_url": "https://wpml.org/forums/topic/split-subcat-pages-are-still-not-showing-any-produt/", "text": "Split: subcat pages are still not showing any produt The client was experiencing an issue where subcategory pages were not displaying any products, despite products being loaded into those categories. This problem persisted even after syncing the menu and setting English as the default language.", "solution": "We recommended disabling the WPML plugins to verify if the issue was related to WPML, as the problem occurred in the default language. Upon disabling the WPML plugins, the URLs reverted to English and functioned correctly, suggesting a potential conflict with WPML. We also advised the client to ensure that the Breeze Cache plugin's cache was cleared, as they were not using any CDN or server-level cache."}
{"case_id": "3b36b5d96549176d", "topic_url": "https://wpml.org/forums/topic/string-translation-doesnt-translate-on-the-front-end/#post-17486585", "text": "The client was unable to see the translated strings on the front end of their website, despite having added the necessary translations under the correct domain and word. The issue was observed with strings within a shortcode.", "solution": "We recommended the client to ensure that the strings were correctly registered and translated in WPML. We provided a revised version of the shortcode function to correctly apply translations using the __(...) and apply_filters('wpml_translate_single_string', ...) functions. Here is the revised code: function render_homeblock() {<br /> ob_start();<br /> ?><br /> <div class=\"just-center row\"><br /> <div class=\"col-xs-12 col-sm-6 col-md-6 col-lg-4\"><br /> <div class=\"content_box boxes blue res_val\"><br /> <div class=\"background_img\" style=\"background-image:url('/wp-content/uploads/2021/09/residential-valuation_min.webp');\"></div><br /> <div class=\"link_wrap overlay_wrap\"><br /> <h3><?php echo __('Residential Valuation', 'cm_text'); ?></h3><br /> <span class=\"abs_wrap\"><br /> <a href=\"<?php echo __('/services', 'cm_text'); ?>/residential-property-valuation\" title=\"<?php echo __('Residential Valuation', 'cm_text'); ?>\"><?php echo __('Learn More', 'cm_text'); ?></a><br /> </span><br /> </div><br /> </div><br /> </div><br /> </div><br /> <?php<br /> return ob_get_clean();<br />}<br />add_shortcode('display_homeblocks', 'render_homeblock'); We tested this solution on a sandbox site, and it worked correctly."}
{"case_id": "b540900389a05070", "topic_url": "https://wpml.org/forums/topic/500-internal-server-error-when-accessing-translated-pages/", "text": "500 Internal Server Error when accessing translated pages The client is experiencing a 500 Internal Server Error when accessing translated versions of their website in languages other than the main language (Spanish). This issue occurs specifically with URLs like /nl/, /fr/, /de/, etc. The error does not affect the default Spanish pages. The problem seems to be related to the Homelengo Real Estate theme, which triggers a PHP fatal error when WPML is active or when visiting pages in secondary languages. Additionally, there are issues with internal redirects and REST endpoints used by Contact Form 7.", "solution": "We recommend the following steps to troubleshoot and potentially resolve the issue: 1. Contact the hosting provider to check the server error logs for more specific details about the error. 2. Disable the Homelengo Real Estate theme temporarily to see if the issue persists with a default theme. 3. Deactivate and reactivate WPML and Contact Form 7 to check if the issue is specifically related to these plugins. 4. Review and possibly adjust the .htaccess file to normalize /wp-json with language prefixes. 5. Flush permalinks and caches to ensure no stale settings are causing the issue. 6. If the problem continues, provide the debug log to the WPML support team for further analysis. You can find instructions on how to provide this information here: https://wpml.org/faq/provide-debug-information-faster-support/ If these steps do not resolve the issue or if the solution seems outdated or irrelevant to your specific case,"}
{"case_id": "8c4a5a2835a18045", "topic_url": "https://wpml.org/forums/topic/how-can-we-show-a-language-switcher-on-the-menu-using-a-shortcode-2/", "text": "How can we show a language switcher on the menu using a shortcode You are trying to display a language switcher on the menu using a shortcode.", "solution": "If you're experiencing this, we recommend you follow these steps: 1. Navigate to WPML → Languages. 2. Enable the option 'Custom Language Switchers'. 3. Use the shortcode [wpml_language_selector_widget] to display the language switcher wherever you need it. You can also customize the appearance and behavior of the shortcode switcher under WPML → Languages → Custom Language Switchers. For more details, visit Adding Language Switchers using PHP and Shortcodes ."}
{"case_id": "7334379cc04989e9", "topic_url": "https://wpml.org/forums/topic/wpml-elementor-translation-sync-issue-after-editing-secondary-language/?paged=2", "text": "2 The client is experiencing issues with WPML and Elementor Pro on their multilingual site. Specifically, translated pages are not applying Elementor templates correctly, and Forminator forms are not being detected by WPML for translation.", "solution": "For the Elementor template issue, we recommend setting the '_cmsmasters_locations' custom field to 'Copy' at WPML > Settings > Custom Field Translation. Then, update the original template and re-translate using the WPML Translation Editor to ensure the template's location rule copies correctly. If issues persist, it may require compatibility adjustments from the theme or plugin developers. For more details, revise the last comment on this ticket. For Forminator, as it lacks WPML integration, create separate forms for each language and manually use the shortcode on the respective pages. Consider scanning the plugin for strings at WPML > Theme & Plugin Localization and translating any detected strings at WPML > String Translation. Alternatively, explore other form plugins compatible with WPML, listed here: https://wpml.org/plugin-functionality/form/ If these solutions do not resolve the issues or seem outdated,"}
{"case_id": "58e0c43a1916c980", "topic_url": "https://wpml.org/forums/topic/wpml-slowing-down-my-dashbard/", "text": "Wpml slowing down my dashbard You are experiencing a slowdown in the dashboard while trying to translate a recipe from French to English on your blog.", "solution": "We are aware of your issue and a colleague has already been assigned to your support ticket. Please follow the same ticket here: https://wpml.org/fr/forums/topic/https-www-mesinspirationsculinaires-com-en/ . If this solution becomes irrelevant, either because it’s outdated or not applicable to your case,"}
{"case_id": "cf2fbd94dde59ab3", "topic_url": "https://wpml.org/forums/topic/fao-paola-mendiburu/#post-17560883", "text": "The client requested a credit refund for their site, noting discrepancies in credit usage for DeepL and PTC, with a total request of 275,000 credits.", "solution": "We refunded the 200k credits as requested. However, we advised the client that ongoing translations use the engine selected at the time of sending the translation. For future instances, if the same text is translated and stored in the translation memory, it should apply to other products. However, to ensure the translation memory is applied correctly, it's recommended to send products for translation in smaller batches."}
{"case_id": "932feb81f6312142", "topic_url": "https://wpml.org/forums/topic/wpml-update-4-8-5-causes-critical-error/", "text": "WPML update 4.8.5 causes critical error After updating WPML from version 4.8.1 to 4.8.4, a critical error occurred causing the site to crash. The error was specifically an E_ERROR in /nas/content/live/oolie/wp-content/plugins/sitepress-multilingual-cms/vendor/wpml/wpml/src/Infrastructure/Dic.php with the message that the class \"AurynInjector\" was not found.", "solution": "We recommend updating WPML to the latest version, 4.8.5, to resolve this issue. You can find the latest version in your WPML account under My Account -> Downloads . Follow the instructions on that page to update WPML. Ensure to backup your database before proceeding with the update. If the 'Check for updates' button is not visible, you may need to manually check for updates in the Plugins → Add New Plugin → Commercial tab. If updating does not resolve the issue or if this solution becomes outdated,"}
{"case_id": "0cfd4a4a791c0a62", "topic_url": "https://wpml.org/forums/topic/some-blocks-on-the-french-homepage-appear-in-english-although-the-wpml-translation-is-complete-2/#post-17530293", "text": "The client is using WPML with Divi and WooCommerce for managing translations on their website. Although the French translations are complete and visible in the WPML interface, some blocks on the French homepage still appear in English. This issue is noted particularly in sections like 'Huile Impériale Régénérante'. The templates for Header, Body, and Footer are locked as system types in WPML settings and cannot be set to 'Translatable – only show translated items'.", "solution": "We recommend the following steps to potentially resolve the issue: 1. Open the default language Home page in Edit mode. 2. Make a minor change, such as adding a space or a plus sign in the page title. 3. Update the page by pressing the “Update” button. 4. Remove the small change made in step 2. 5. Update the page again. 6. Open the translated page in WPML Translation Editor, ensure the translation is 100% complete, and press the Complete Translation button. If the problem persists, we suggest providing temporary access (WP-Admin and FTP Login info) to your site for further debugging. Please ensure to back up your database and website before making changes or providing access. This solution might be outdated or not applicable to your specific case."}
{"case_id": "3951a520c10625b2", "topic_url": "https://wpml.org/forums/topic/the-translator-could-not-be-assigned-to-the-job-8/", "text": "The translator could not be assigned to the job If you're experiencing issues with assigning translators to translation jobs in WPML and encountering errors, it might be due to restrictions set by your hosting provider on your database user or blocked connections to WPML-related domains.", "solution": "We recommend checking with your hosting provider to ensure that your database user does not have any restrictions, particularly with commands like ALTER . Also, verify that connections to wpml.org and ate.wpml.org are not being blocked. Once these issues are resolved, the translation functionality should work correctly."}
{"case_id": "34d292a6f54b1ac8", "topic_url": "https://wpml.org/forums/topic/credits-transfer-2/", "text": "Credits transfer The client reported that after transferring a website to a customer's account, the credits assigned did not appear in the customer's account, while they were deducted from the client's account.", "solution": "We suggested waiting a short period as sometimes updates to account balances can be delayed. Indeed, the credits appeared in the customer's account about 10-20 minutes after the transfer. If you're experiencing a similar issue, we recommend checking the account balance after a brief interval to allow for system updates. If the problem persists, please provide us with the URL of the website, the number of credits transferred, the date of the transfer, and your client's account email so we can assist you further."}
{"case_id": "5d7f63f97a760aff", "topic_url": "https://wpml.org/forums/topic/syncing-woocommerce-product-variation-language-with-wpml-site-language/", "text": "Syncing WooCommerce product variation language with WPML site language The client is trying to synchronize WooCommerce product variations with the active WPML language on their development site. Specifically, they want the default product variation to automatically switch to match the WPML language when the site language is changed.", "solution": "We have evaluated the possibility of setting different default WooCommerce variation values per language. However, we decided not to implement this feature. The reason is that WPML's current logic ensures consistent synchronization of product data across translations. Supporting localized default variations would require significant changes to this logic, and our translation model focuses on translating—not localizing—product structure. Therefore, this feature falls outside our current scope."}
{"case_id": "f56cad46d7eaed0a", "topic_url": "https://wpml.org/forums/topic/api-rest-not-disponible/", "text": "API Rest not disponible You have installed WPML on your site and are experiencing intermittent unavailability of the REST API. The REST API becomes unavailable across the entire site for about one minute, then returns before going offline again for a few minutes.", "solution": "We have identified that deactivating the WPLoyalty - WooCommerce Loyalty Points, Rewards and Referral Pro plugin resolves the issue. This plugin is currently not compatible with WPML. We recommend contacting the plugin author for more insights on the issue and to check if they can provide a solution. Meanwhile, if the plugin author indicates any direct relation of WPML to the issue, please inform us. This solution might be outdated or not applicable to your case."}
{"case_id": "9beb4a4948b7c893", "topic_url": "https://wpml.org/forums/topic/cannot-transfer-credits/?paged=1", "text": "1 The client was unable to transfer translation credits from a staging site to the main domain using the WPML plugin. The documentation appeared outdated, and the client's account environment did not display the option to transfer credits or manage URLs effectively.", "solution": "We advised the client to check for browser extensions that might interfere with the site's functionality and recommended trying a different browser or device. We moved 1852 credits back to the client's WPML.org account, bringing the total to 22982 credits. We confirmed that the credits were visible in the client's account and addressed the client's concerns about the limitations of an End-user type account. For further changes, such as modifying the domain or upgrading the subscription, we directed the client to the relevant documentation on transferring account renewals ( https://wpml.org/purchase/transferring-account-renewals-to-your-clients/ ) and refunds ( https://wpml.org/purchase/refunds/ ). If the solution provided here does not resolve your issue or seems outdated,"}
{"case_id": "2c597273fe46bfa5", "topic_url": "https://wpml.org/forums/topic/wpml-editor-misses-translations/?paged=2", "text": "2 The client was experiencing issues with their WPML editor where translations were not displaying correctly. They expected to see a column with original language texts and another with translations, but instead, some items showed translations while most displayed the original text. The client had previously set up a staging site and migrated the translation memory, which was treated as a separate entity, causing the main site to lose its translations.", "solution": "We advised the client that during the staging site setup, they should have selected the option 'I logged in from another domain' to ensure the staging site was connected to the same automatic translation account as the live site. This would have allowed the sites to share the translation memory and avoid re-translating content that was already translated. We provided documentation on how to properly connect websites and share their translation memory: https://wpml.org/documentation/automatic-translation/automatic-translation-subscription-for-multiple-sites/ . If the client confirms, we can also manually copy the memory back to the live site from our side."}
{"case_id": "ab4474a762646283", "topic_url": "https://wpml.org/forums/topic/translating-search-filter-fields/", "text": "Translating Search & Filter fields The client was experiencing issues with the Advanced Translation Editor (ATE) in WPML, specifically receiving errors such as 'Unable to retrieve job details' and 'Jobs could not be loaded' while trying to translate Search & Filter fields using ACF and Elementor Pro.", "solution": "1. Ensure all WPML plugins are updated to the latest versions by navigating to Plugins → Add New → Commercial tab. 2. Clear all caches, including WPML's cache, by going to WPML → Support → Troubleshooting and using the provided tools. 3. Verify the ATE API connection under WPML → Settings → Translation Editor . 4. Use WPML's troubleshooting tools to remove ghost entries and fix database collation issues. 5. Check Elementor widgets for excessively long strings or complex content that might be causing issues. 6. Install and activate the ACF Multilingual plugin, set ACF field translation preferences, and update original posts/pages to trigger new translation settings. 7. If issues persist, manually inspect WPML job queues and database for stalled or corrupted translation jobs. 8. Review for known WPML/ACFML conflicts, especially with Elementor, and check logs for related errors. If these steps do not resolve the issue or if the solution seems outdated or irrelevant to your specific case,"}
{"case_id": "281250828867d242", "topic_url": "https://wpml.org/forums/topic/cannot-transfer-credits/?paged=5#post-17509604", "text": "The client was unable to transfer translation credits from a staging site to the main domain using the WPML plugin. The documentation appeared outdated, and the client's account environment did not display the option to transfer credits or manage URLs effectively.", "solution": "We advised the client to check for browser extensions that might interfere with the site's functionality and recommended trying a different browser or device. We moved 1852 credits back to the client's WPML.org account, bringing the total to 22982 credits. We confirmed that the credits were visible in the client's account and addressed the client's concerns about the limitations of an End-user type account. For further changes, such as modifying the domain or upgrading the subscription, we directed the client to the relevant documentation on transferring account renewals ( https://wpml.org/purchase/transferring-account-renewals-to-your-clients/ ) and refunds ( https://wpml.org/purchase/refunds/ ). If the solution provided here does not resolve your issue or seems outdated,"}
{"case_id": "1e2d55706859a425", "topic_url": "https://wpml.org/forums/topic/complianz-privacy-statement-documents-in-other-languages-2/", "text": "Complianz privacy statement documents in other languages The client needed help translating the privacy statement documents for Complianz in different languages, specifically having issues with the page displaying correctly in Dutch.", "solution": "1. We advised the client to refer to the previous support ticket where the steps to translate Complianz texts were outlined. 2. We provided a link to a detailed guide on how to handle translations for Complianz GDPR/CCPA Cookie Consent, which can be found here: https://wpml.org/plugin/complianz-gdpr-ccpa-cookie-consent/ 3. We requested a screenshot or a specific text piece to better locate the issue on the site. 4. We asked for administrative access to the site to ensure proper configuration and troubleshooting. 5. Once access was confirmed, we directed the client to translate the strings via WPML -> String Translation at this specific URL: https://belledejour.be/wp-admin/admin.php?page=wpml-string-translation%2Fmenu%2Fstring-translation.php&context=complianz-gdpr"}
{"case_id": "99d63f3b10a1506f", "topic_url": "https://wpml.org/forums/topic/the-background-video-is-not-showing-the-files-assigned-in/", "text": "The background video is not showing the files assigned in You are developing a site and want to use different background video files for different languages. Despite using the 'media translation' feature in WPML, the frontend is showing the same video files for all languages.", "solution": "This issue appears to be a compatibility problem with the background video URL. As a temporary workaround, we recommend you open the default language page in Edit mode, disable the WPML Translation Editor, then edit the translated page in Bricks Builder and manually update the video URL. This should resolve the issue temporarily. For more details, please refer to the documentation on how to use WPML with Bricks Builder ."}
{"case_id": "2845ac9267ae6570", "topic_url": "https://wpml.org/forums/topic/cant-translate-avada-woo-filter-by-price-element/", "text": "Can’t translate Avada woo filter by price element The client was unable to see the 'Woo Filter by Price' element on the English and German pages of their Avada theme, preventing duplication and translation.", "solution": "We identified that the 'Woo Filter by Price' element might not automatically duplicate or translate due to its dependency on WooCommerce widget areas or filter logic. Here are the steps we recommend: 1. Ensure the element exists in the original layout and check if it's set to appear based on widget areas or dynamic conditions that might differ on translated pages. 2. If the element is added via a widget, go to Appearance > Widgets and verify if it's present in the language-specific widget areas. 3. If necessary, manually recreate the filter for each translated language. 4. Ensure that all products and categories you wish to filter by are translated into the respective languages. 5. Navigate to the backend of the German version of the Shop template, select 'Edit anyway', and manually add the missing price filter. 6. Use the WordPress editor as recommended by Avada developers for translating layout sections. More details can be found here: Translating Avada Layout Sections ."}
{"case_id": "b759edb4f5db4728", "topic_url": "https://wpml.org/forums/topic/i-am-trying-to-synchronize-product-availability-and-delivery-date-formats-across-different-languages/#post-17585037", "text": "You are trying to synchronize product availability and delivery date formats across different languages on your site using WPML. The product availability is not synchronized between languages; in one language, the product is in stock, while in others, it is out of stock. Additionally, the delivery dates show in different formats in each language.", "solution": "We recommend updating the original product and its translations. Here’s how you can do it: 1. Add a temporary change to the description of the original product (e.g., adding the word \"test\"). 2. Save the changes. 3. Open the translations and save them. 4. Remove the temporary change from the description and save again. Repeat these steps for each product to ensure synchronization across all languages."}
{"case_id": "226033afc4cb3c82", "topic_url": "https://wpml.org/forums/topic/blog-posts-in-link-format-not-working-after-switching-translation-2/", "text": "Blog Posts in Link Format Not Working After Switching Translation You are experiencing issues with PDF links on your News page not opening correctly in Spanish translations. While the links open correctly in English, they redirect to a blog page instead of opening the PDF in Spanish.", "solution": "To ensure that PDF links open correctly in all translations, follow these steps: 1. Navigate to WPML > Settings. 2. Ensure the \"Show 'Multilingual Content Setup' meta box on post edit screen\" option is checked. 3. Edit the page where the PDF links are set and scroll to the bottom. 4. Enable translation for the custom field \"_nectar_link\". 5. Use the Advanced Translation Editor to translate the link."}
{"case_id": "2a9972f579c6e902", "topic_url": "https://wpml.org/forums/topic/split-translate-the-footer-complete/", "text": "Split: translate the Footer complete If you're experiencing difficulties with translating the complete footer in your website,", "solution": "We recommend that you first navigate to WPML → String Translation and search for the strings that still need translation. If you do not find them there, you should check the Admin Texts Translation section. For detailed guidance, please visit https://wpml.org/forums/topic/split-set-a-different-logo/ . If the issue persists, please inform us about how the footer was created (whether through a theme builder, Elementor, WPBakery, widgets, or a custom template). This information will help us determine where the strings are stored and how they should be translated."}
{"case_id": "0785e96869c5136c", "topic_url": "https://wpml.org/forums/topic/translated-page-doesnt-display-properly-with-wrong-url/?paged=2#post-17558171", "text": "The client experienced issues like a WPML-related banner about Media Translation setup did not disappear. Also, the client realized that the Translation Dashboard entries did not match up with the translation status of existing content.", "solution": "1. We recommended increasing the WordPress memory limit to at least 256 MB to meet WPML's minimum requirements, which could help with overall site performance and stability. The client can add the following code to the wp-config.php file: define('WP_MEMORY_LIMIT', '256M'); 2. For the media translation installation issue, disabling and re-enabling the 'WPML Media Translation' plugin resolved the notification banner problem. 3. Regarding the translation job issues, it was suggested to check if any original content existed twice on the website. We found various posts sharing the same title, which led to confusion for the client on the Translation Dashboard. If these solutions do not resolve your issues or seem outdated,"}
{"case_id": "fc62fc4dc738b314", "topic_url": "https://wpml.org/forums/topic/only-the-page-titles-on-my-site-are-being-translated-the-rest-of-the-page-content-is-not-being-tran/#post-17561481", "text": "The client is using WPML with a theme called Digicove and Elementor, but only the page titles are being translated automatically. The rest of the page content, including custom Elementor widgets, is not being translated.", "solution": "We identified that the theme and its custom Elementor widgets were not officially compatible with WPML, which caused the translation issues. To resolve this, we recommended registering the custom Elementor widgets for translation following the guide at https://wpml.org/documentation/support/language-configuration-files/how-to-register-page-builder-widgets-for-translation/#register-custom-elementor-widget-for-translation . We assisted the client by manually configuring and translating a few pages to demonstrate the process. We advised the client to re-save and re-translate other pages to see if any widget still needed to be added."}
{"case_id": "0ad094302e6025f3", "topic_url": "https://wpml.org/forums/topic/i-need-to-reset-my-password-but-it-says-i-dont-have-a-usable-password/#post-17645387", "text": "The client needs to reset their password but receives a message indicating they don't have a usable password.", "solution": "If you're experiencing this issue because you are using a social media login (like Google), you won't be able to change your password directly as authentication is managed through the social media account. We recommend you try the following steps: 1. Disconnect the social media account from your WPML profile. 2. Log out of your WPML account. 3. Visit https://wpml.org/account and click the Login button. 4. Use the 'Forgot password' option to generate a new password. After completing these steps, you should be able to log in using your email and password and change the password later without any issues."}
{"case_id": "170d1c6c35686122", "topic_url": "https://wpml.org/forums/topic/can-not-delete-media-and-translations/#post-17508990", "text": "The client is experiencing issues with deleting translations in WPML. Specifically, deleting English translations stops after a few seconds, deleting Spanish translations works for a minute then errors, and restarting the Spanish translation deletion process stops immediately. Additionally, the client is unable to delete all translated media and products efficiently and faces visibility issues of products in the frontend after attempting to reset and disable WPML.", "solution": "We are already addressing these issues in another support thread. Please refer to the ongoing discussion and solutions provided in the following links: Why the content on product detail pages, for example, is duplicated when we disable WPML Further explanation on default language issues Discussion on clean WPML uninstall"}
{"case_id": "df5c8e7d003298ec", "topic_url": "https://wpml.org/forums/topic/there-is-a-problem-with-the-string-translation-table-2/#post-17658504", "text": "There is an issue with the String Translation table on the client's site, which could potentially become a critical issue in the future.", "solution": "If you're experiencing a similar issue, we recommend using the WPML troubleshooting functions to fix the collations. This approach has resolved the problem in this case."}
{"case_id": "acc96773c0703571", "topic_url": "https://wpml.org/forums/topic/scroll-to-anchor-id-is-not-working/", "text": "Scroll to anchor id is not working You are trying to translate a scroll to anchor link on your WordPress site using WPML, but when you translate the link, the anchor ID gets removed. This causes the page not to scroll to the intended ID.", "solution": "To ensure your translated links retain their anchor IDs, follow these steps: 1. Access the original page: Go to your WordPress admin and navigate to Pages . Find the original (English) page that contains the footer link you're trying to translate. 2. Open the translation in WPML Translation Editor: Next to the original page, you'll see language flags. Click the pencil icon for the French language to open the page in WPML's Translation Editor (ATE). 3. Locate and verify the anchor link: In the Translation Editor, search for the text of your link and ensure the anchor ID is correctly included in the translation."}
{"case_id": "f876a3b7b7505573", "topic_url": "https://wpml.org/forums/topic/when-we-change-language-on-page-then-page-layout-will-be-me-sup/?paged=2#post-17642756", "text": "The client was experiencing layout issues when switching languages on their website, which could be due to theme compatibility or incorrect language settings.", "solution": "1. Verify the correct language assignment for affected pages in the WordPress admin. 2. Temporarily switch to a default WordPress theme like Twenty Twenty-Three to check if the issue persists, indicating a theme-related problem. 3. Clear all caches to ensure changes take effect. 4. Update all WPML plugins, the site theme, and other plugins to their latest versions. 5. If the issue persists, consider advanced troubleshooting such as custom CSS or page builder configurations."}
{"case_id": "75eae8360dc2271e", "topic_url": "https://wpml.org/forums/topic/using-wpml-with-themeco-pros-single-post-layout/?paged=3", "text": "3 The client is experiencing issues with the single post layout when using WPML with ThemeCo Pro, specifically with a custom post type. The site crashes, likely due to insufficient server resources.", "solution": "1. We installed the ACFML addon to support Advanced Custom Fields (ACF) integration with WPML. For detailed steps on this setup, visit https://wpml.org/documentation/related-projects/translate-sites-built-with-acf/ . 2. We configured the 'acf-field-group' to 'Not Translatable' in WPML > Settings to avoid unnecessary translation loads. 3. We attempted to delete the English single layout for the custom post type so that Cornerstone would automatically use the Dutch layout instead, but the site continued to crash. 4. We checked and confirmed that the header is locked for translation, and the footer was not translated."}
{"case_id": "ca939bc9f0aebcfb", "topic_url": "https://wpml.org/forums/topic/compatibility-issue-between-tutor-lms-and-wpml/", "text": "Compatibility issue between Tutor LMS and WPML You are using WPML with Tutor LMS Pro to translate courses on your website. After changing the default language from Greek to English, courses are visible in English but not in Greek on the student courses dashboard.", "solution": "This behavior is expected because in Tutor LMS, courses in different languages are treated as separate entities. A student enrolled in a course in one language is not automatically enrolled in the translated version of the course. To have courses appear in both languages, custom coding is necessary to link the enrollments across languages, but this is outside the scope of our support."}
{"case_id": "250122505199952c", "topic_url": "https://wpml.org/forums/topic/translating-emails-sent-from-domains/", "text": "Translating Emails sent from domains The client is facing an issue where the registration approval email from 'registration-form-for-woocommerce' and the account approval email from 'woocommerce b2b' are sent in German, regardless of the user's chosen language.", "solution": "We recommend modifying the WooCommerce B2B plugin to ensure emails are sent in the correct language. Here are the steps: 1. Navigate to wp-content/plugins/woocommerce-b2b/includes/classes/emails/class-wcb2b-email-customer-status-notification.php . 2. Replace the existing code block with the following: if (wcb2b_has_role($user_id, 'customer')) {<br /> if ($this->is_enabled() && $this->get_recipient()) {<br /> $this->user_id = $user_id;<br /> if (class_exists('sitepress')) {<br /> do_action('wpml_switch_language_for_email', $this->recipient);<br /> } else {<br /> $this->setup_locale();<br /> }<br /> $this->send($this->get_recipient(), $this->get_subject(), $this->get_content(), $this->get_headers(), $this->get_attachments());<br /> if (class_exists('sitepress')) {<br /> do_action('wpml_restore_language_from_email');<br /> } else {<br /> $this->restore_locale();<br /> }<br /> }<br />} 3. Test by creating a new user and assigning them a language, then update the user and change their status to active. The activation email should arrive in the correct language."}
{"case_id": "3db1c3eed41eae78", "topic_url": "https://wpml.org/forums/topic/smaill-issues/?paged=2#post-17500227", "text": "You are experiencing issues with parts of your website changing unexpectedly and the logo altering after installing WPML for translating a page from Albanian to English and Italian.", "solution": "If you're noticing changes in your website's widgets or logo after installing WPML, we recommend checking the \"Display as Language\" option in your widget settings. You have two choices: create separate widgets for each language and assign them accordingly, or use WPML’s String Translation to manage the translations. The latter option will prevent the need to maintain multiple widgets. If these steps do not resolve your issue, or if the solution seems outdated or not applicable to your case,"}
{"case_id": "f10c3b4b8bd8fa8a", "topic_url": "https://wpml.org/forums/topic/some-of-my-translated-templates-are-not-working-missing-logo-from-header/", "text": "Some of my translated templates are not working + missing logo from header You are experiencing issues with automatically translating your webpage using WPML. Some templates are not assigned correctly, and the logo is missing from the header in the translated versions of your web pages.", "solution": "We have identified that the issue with the templates arises because the translated posts have different slugs, which affects template assignment. For instance, if the original template is 'page-courses', but the translated post slug is 'individualni-kurzy', you need to change the translated template to 'page-individualni-kurzy'. This adjustment should resolve the template assignment issue. Regarding the missing logo, this part of the issue might require further investigation. We recommend checking if the logo's path is correctly set in the translated versions and ensuring that the theme or customizer settings are correctly applied across all languages. We have also escalated this case to our developers to find a permanent solution."}
{"case_id": "9596ea79197424f0", "topic_url": "https://wpml.org/forums/topic/pictures-on-betterdocs-secondary-language-article-are-replaced-with-original-lnaguage-pictures-after/?paged=2", "text": "2 You are using BetterDocs with WPML to translate articles and replace images in the translated versions. However, when you update the original article and its translation, the images in the translated article revert to those from the original article. This issue arises because you are mixing different editors during the translation and update process.", "solution": "To prevent images in the translated articles from being overwritten, we recommend the following steps: 1. Consistently use the same editor for both the original and translated content to avoid conflicts. You can find more information on using different translation editors here: Using Different Translation Editors for Different Pages . 2. Use the WPML Media Translation module to manage how images are handled across different languages. This approach ensures that images remain consistent with their respective language versions. Learn more about this method here: How to Display Different Media per Language . Please avoid using different editors for the original and translated content as this can lead to the issues you're experiencing."}
{"case_id": "5703c297dd62e392", "topic_url": "https://wpml.org/forums/topic/not-finding-template-part-or-footer-template/#post-17652998", "text": "If you're experiencing issues with not finding the template part or footer template on your multilingual site,", "solution": "We recommend checking if an empty footer has been set for the entire site. In a recent case, we found that removing the empty footer setting resolved the issue, and the correct footer appeared in all languages. Please verify on your site if this solution applies. Keep in mind that this solution might be outdated or not applicable to your specific case."}
{"case_id": "8d44978af6633cc0", "topic_url": "https://wpml.org/forums/topic/the-plugin-on-the-website-says-is-registered-the-wpml-dashboard-says-is-inactive/#post-17589453", "text": "You are trying to use credits purchased for WPML, but you cannot because the WPML dashboard indicates that your website is inactive, even though the plugin on your website shows it is registered.", "solution": "We have resolved this issue from our end. You should now be able to use your credits. Please verify by checking if the WPML dashboard now reflects the active status of your website."}
{"case_id": "186d7fc2c13824a5", "topic_url": "https://wpml.org/forums/topic/automatically-translate-alt-text-for-images/#post-17589909", "text": "You are trying to automatically translate Alt text for images on your site using WPML, but despite enabling the automatic detection option in WPML > Settings > Media Translation, the Alt text is not translating into German.", "solution": "1. Update WPML Plugins: Go to Plugins → Installed Plugins in your WordPress dashboard. Look for WPML Multilingual CMS and WPML String Translation . If an update notification is present, please update them to their latest versions. 2. Confirm Media Translation Settings: Navigate to WPML → Settings . Scroll down to the Media Translation section. Ensure both Automatically detect best options for translating image texts and Translate media library texts with posts are enabled. Click Apply if you make any changes. 3. Trigger a Translation Update: Go to Pages and Edit your original English page that contains the images in the carousel. Make a minor change to the page content and click the Update button to save the page. This action helps WPML recognize and push all associated media texts for translation. 4. Check in the Advanced Translation Editor: Go to WPML → Translation Dashboard . Find your English page and click the pencil icon next to the German language to open it in the Advanced Translation Editor . Look for the Alt text segments for your images. If you see them, complete the translation and mark the translation as complete. After these steps, check your German page on the frontend to see if the Alt text is now translated correctly. If you have any caching plugins, it's a good idea to clear your site cache after making these changes."}
{"case_id": "7f4838409e9a5653", "topic_url": "https://wpml.org/forums/topic/pictures-on-betterdocs-secondary-language-article-are-replaced-with-original-lnaguage-pictures-after/?paged=1", "text": "1 You are using BetterDocs with WPML to translate articles and replace images in the translated versions. However, when you update the original article and its translation, the images in the translated article revert to those from the original article. This issue arises because you are mixing different editors during the translation and update process.", "solution": "To prevent images in the translated articles from being overwritten, we recommend the following steps: 1. Consistently use the same editor for both the original and translated content to avoid conflicts. You can find more information on using different translation editors here: Using Different Translation Editors for Different Pages . 2. Use the WPML Media Translation module to manage how images are handled across different languages. This approach ensures that images remain consistent with their respective language versions. Learn more about this method here: How to Display Different Media per Language . Please avoid using different editors for the original and translated content as this can lead to the issues you're experiencing."}
{"case_id": "3e555b1d5c2c4c51", "topic_url": "https://wpml.org/forums/topic/logo-issue-and-html-tables/?paged=1", "text": "1 You are working on translating a website into multiple languages using WPML and facing three issues: 1. A post is stuck during translation. 2. The logo does not appear in the header navigation for languages other than English. 3. Texts from tables on specific pages are not translated into other languages.", "solution": "1. The stuck post translation job was unassigned, and we canceled it to resolve the issue. 2. For the logo not appearing in other languages, it was not translated in WPML-> Media Translation. We have now translated it. Please verify the logo in the header across all languages. 3. To translate texts from tables that are added as HTML and not automatically translated in ATE, follow these steps: - Edit the page in the default language. - From the language side panel, click the pencil icon to open the translation editor. - Search for any word in the table. - You will see the table in the HTML field. - Translate it and save the translation."}
{"case_id": "a74de30f03a8d4a5", "topic_url": "https://wpml.org/forums/topic/upgrade-unseres-abos/", "text": "Upgrade unseres Abos Sie versuchen, Ihr Abo zu upgraden, aber beim Versuch erhalten Sie die Fehlermeldung: 'Cannot read properties of null (reading 'submit')'.", "solution": "Wenn Sie administrative Unterstützung benötigen, empfehlen wir Ihnen, das dedizierte Formular unter https://wpml.org/home/contact-us/contact-form/ zu verwenden. Dort wird man Ihnen bei Ihrem Abonnement weiterhelfen können. Falls Sie technische Probleme auf Ihrer Website haben, zögern Sie nicht, uns zu kontaktieren. Wir helfen Ihnen gerne weiter. Bitte beachten Sie, dass diese Lösung möglicherweise irrelevant sein könnte, da sie veraltet ist oder nicht auf Ihr Problem zutrifft. Wir empfehlen Ihnen, die Seite mit bekannten Problemen ( https://wpml.org/known-issues/ ) zu überprüfen, die Version der dauerhaften Lösung zu verifizieren und zu bestätigen, dass Sie die neuesten Versionen von Themes und Plugins installiert haben. Sollte das Problem weiterhin bestehen, zögern Sie nicht, ein neues Support-Ticket zu eröffnen. Besuchen Sie dazu unser Support-Forum unter https://wpml.org/de/forums/forum/support-in-german/ ."}
{"case_id": "a57d4d16a75d113c", "topic_url": "https://wpml.org/forums/topic/custom-logo-and-alignment-of-navigation-bar-for-rtl-menu-in-astra-theme/#post-17491041", "text": "WPML forum thread The client is experiencing an issue where the site logo is not appearing in the translated header and footer on their multilingual website.", "solution": "If you're facing a similar issue, we recommend following these steps: 1. Ensure you have a backup of your site. 2. Install and activate the WPML Media Translation plugin. You can install it via your WP dashboard under Plugins >> Add New Plugin > Commercial tab, or download it from here . 3. Navigate to WPML >> Media Translation. 4. Search for 'logo' and press the Filter button. 5. Click on the Plus (+) icon, add the logo name in the Name field to enable the save button, and then press the “Save media translation” button. 6. Clear all sorts of site/server/CDN cache. If the logo still does not appear, you might consider deactivating and deleting the WPML Media Translation plugin as it should continue to work. Alternatively, check the suggestions in this thread: WPML forum thread ."}
{"case_id": "0bff421277d8a7c6", "topic_url": "https://wpml.org/forums/topic/string-translation-103/", "text": "String Translation If you're experiencing an issue where the string 'Type' in the property search form is not translating on the frontend despite being marked as 'Complete' in WPML String Translation, and you have already scanned all theme and plugin files, cleared the cache, and synchronized the string tables, follow these steps for a possible solution.", "solution": "1. Confirm that the WPML and PHP memory limits are at least 128M; increase to 256M if necessary. 2. Rescan theme and plugin files, clear all caches, and synchronize string tables again. 3. Delete and re-register the 'Type' string via WPML String Translation. 4. Search exhaustively in Admin Texts Translation under all relevant domains (e.g., theme_mods_homelengo , homelengo_options ). 5. Examine Elementor Pro widget/template for manual/auto field label input, including translation of its templates. 6. Validate all string translation entries for 'Type' across multiple domains (theme, plugin, acf-field-group, admin_texts). 7. Verify and enable \"Auto register untranslated strings\"; revisit the frontend in both languages. 8. Review for theme-specific implementation quirks: Confirm how the theme outputs the 'Type' field label, searching for hardcoded, non-translatable output or JS/HTML overrides. 9. Check for localization issues (e.g., improper use of translation functions like __() or _e() , or outputting raw strings outside translation context). 10. Manually inspect frontend output and theme template files related to property forms, focusing on localization logic for the label. Do not repeat string rescanning, cache clearing, admin texts review, or memory limit increases."}
{"case_id": "260693bfae88bda4", "topic_url": "https://wpml.org/forums/topic/switching-from-wpml-to-gtranslate-and-back-pages-are-not-connected/#post-17488334", "text": "After switching from gTranslate back to WPML, the client experienced issues where WPML was not displaying languages correctly in the pages area. Specifically, every translated page appeared multiple times instead of once, and the WPML option to connect other pages was missing in the WordPress editor sidebar.", "solution": "We discovered that in the WPML settings under WPML > Settings > Post types translation , the post type \"Pages\" was set to \"Not translatable\". We changed the setting for pages and posts to \"Translatable\" and saved the WordPress Permalink settings. We then asked the client to review the translations and report any unexpected issues."}
{"case_id": "c867e1e483988eae", "topic_url": "https://wpml.org/forums/topic/wpml-advanced-translation-editor-2/", "text": "WPML Advanced Translation Editor After upgrading to WPML Advanced Translation Editor and using Elementor Pro, the client found that links were not being translated as expected, despite settings indicating they should be.", "solution": "We recommend the following steps to ensure links are translated correctly: 1. Review and Translate Links in Advanced Translation Editor: * Go to the page or post containing the links you wish to translate in your original language. * Edit it and send it for translation to the Advanced Translation Editor . * Once in the ATE, internal links are usually automatically pointed to the language-appropriate version. You can still edit them if needed, as they will appear highlighted. * For external links, use the search bar within the ATE to find and manually adjust them."}
{"case_id": "63b7f168c2b04519", "topic_url": "https://wpml.org/forums/topic/automatic-translations-are-in-progress-issue/?paged=2", "text": "2 If you're experiencing issues with translations being stuck with the error 'automatic translations are in progress' after attempting to delete them in the 'translation jobs' tab, it might be due to the size of the XLIFF files generated for the translation. These files should not exceed 1MB, but in your case, they were 1.06MB.", "solution": "We initially suggested two approaches: reducing the size of the form or consulting our Advanced Translation Editor (ATE) team to see if an exception could be made. We proceeded with the latter, and our ATE team has adjusted the XLIFF file size limit to 1.5MB on your site. Please resend the job for translation. Keep in mind that setting a higher limit might result in longer load times and processing times for translations."}
{"case_id": "55e1eb743761c798", "topic_url": "https://wpml.org/forums/topic/i-need-helo-with-elementor-search-form-i-cant-see-the-translated-property-features-taxonomies/?paged=1", "text": "1 You are using the Real Homes theme and have created a search form with Elementor. Although you have translated the Property Features taxonomies using WPML, the translated features are not displaying in the Elementor search form, except for one feature that remains untranslated and in English.", "solution": "We tested the issue by setting up a new test site with the Real Homes theme and its plugins. After translating a property and its taxonomies, we added the \"RH: Search Form 2\" widget on a translated page. The form displayed all features correctly in the translated language. It appears that the \"RH: Search Form 2\" widget does allow using Real Homes Templates, which are set up in the Customizer's search settings. If you use such a template, you might run into unexpected issues. We were sadly not able to replicate and investigate this issue, as we would require a license key for Real Homes for this purpose. We recommend using the widget without any templates, in case you run into unexpected issues."}
{"case_id": "fd25238ed027bb1f", "topic_url": "https://wpml.org/forums/topic/automatic-translation-gets-stuck-spinning-arrows-%e2%86%92-gear-icon/?paged=1", "text": "1 The client was experiencing an issue where the automatic translation for a Spanish post using WPML was stuck, showing spinning arrows that turned into a gear icon. This problem was isolated to one specific post, and despite various troubleshooting efforts, including making minor edits and attempting to retranslate, the translation job remained incomplete.", "solution": "1. Pause Automatic Translation Temporarily: - Navigate to WPML → Translation Dashboard . - Turn off the 'Translate Everything Automatically' option. 2. Cancel In-Progress Automatic Jobs: - Go to WPML → Support . - Click the Troubleshooting link and select 'Cancel in-progress automatic jobs' to clear stuck jobs. 3. Refresh the Original Post: - Edit the original post slightly and update it to refresh the content for WPML. 4. Resend for Translation: - Return to the WPML → Translation Dashboard and resend the post for Spanish translation. 5. Monitor the Job: - Check the Translation Jobs queue to ensure the job completes. If the translation job still does not progress or if you encounter other issues, we recommend checking the WordPress debug log for errors related to WPML or ATE. Ensure that your plugins and themes are up-to-date as outdated versions can cause issues with job processing. If these steps do not resolve the issue, it may be necessary to inspect WPML-related translation job tables or confirm cron event operations. For further assistance, please visit our support forum at WPML Support Forum . We also highly recommend checking related known issues at https://wpml.org/known-issues/ , verifying the version of the permanent fix, and confirming that you have installed the latest versions of themes and plugins. If the problem persists, please open a new support ticket."}
{"case_id": "afe35706eb0da597", "topic_url": "https://wpml.org/forums/topic/logo-doesnt-appear-on-the-serbian-site/", "text": "Logo doesn’t appear on the Serbian site The client is unable to see the logo on their Serbian site and there are no display photos on recent posts on the Serbian site.", "solution": "If you're experiencing issues with missing logos or images on your multilingual site, we recommend following these steps: 1. Ensure the WPML Media Translation plugin is installed and activated. You can install it via your WP dashboard under Plugins >> Add New Plugin >> Commercial tab, or download it from here . 2. Navigate to WPML >> Media Translation. 3. Use the search function to find the logo by entering 'logo' and clicking the Filter button. 4. Click on the Plus (+) icon next to the logo, add the logo name in the Name field to enable the save button, and then click “Save media translation”. 5. Clear all types of site/server/CDN cache."}
{"case_id": "df64e18c426193ad", "topic_url": "https://wpml.org/forums/topic/split-3d-flipbook-not-displaying-translated-media/?paged=1", "text": "1 If you're experiencing issues with the Real 3D Flip Book plugin showing English images instead of French on the French site, it might be due to the way translations are handled.", "solution": "Firstly, you should translate the FlipBooks using the WordPress Editor, as detailed here: Using different translation editors for different pages . Ensure that the translated Flipbook is correctly set in the Elementor Widget options for the Flipbook. Each Flipbook has a unique shortcode in each language, which should be correctly assigned in the widget settings. The author of the Real 3D FlipBook Plugin is informed and will work on a solution. For developers, adjustments can be made in the plugin files to ensure proper translation handling. In the file \\wp-content\\plugins\\real3d-flipbook-elementor-addon\\widgets\\real3d-flipbook.php , modify the code as follows: On line 308, replace: $book_id = $settings['real3d_flipbook_id']; with: $book_id = isset($settings['real3d_flipbook_id']) ? $settings['real3d_flipbook_id'] : ''; // WPML-aware: try to resolve a translated flipbook ID (fallback to post mapping) if ( ! empty( $book_id ) && ( class_exists('SitePress')) ) { $translated_id = apply_filters( 'wpml_object_id', (int) $book_id, 'real3dflipbook', true ); if ( empty( $translated_id ) ) { $translated_id = apply_filters( 'wpml_object_id', (int) $book_id, 'post', true ); } if ( ! empty( $translated_id ) ) { $book_id = $translated_id; } } And on line 311, replace: $book_lightboxthumbnail = !empty($settings['real3d_flipbook_lightboxthumbnail']['url']) ? $settings['real3d_flipbook_lightboxthumbnail']['url'] : ''; with: $book_lightboxthumbnail = ''; if ( ! empty( $settings['real3d_flipbook_lightboxthumbnail'] ) ) { $thumb = $settings['real3d_flipbook_lightboxthumbnail']; // Prefer attachment ID if available (Elementor provides ['id'] and ['url']) if ( ! empty( $thumb['id'] ) ) { $attachment_id = (int) $thumb['id']; // Use WPML to get translated attachment ID if available if ( class_exists('SitePress')) { $translated_id = apply_filters( 'wpml_object_id', $attachment_id, 'attachment', true ); } else { $translated_id = $attachment_id; } // If we have a translated ID, get its URL if ( ! empty( $translated_id ) ) { $translated_url = wp_get_attachment_url( $translated_id ); if ( $translated_url ) { $book_lightboxthumbnail = $translated_url; } } } // Fallback to the raw URL provided by Elementor if no attachment URL resolved if ( empty( $book_lightboxthumbnail ) && ! empty( $thumb['url'] ) ) { $book_lightboxthumbnail = $thumb['url']; } }"}
{"case_id": "dcefefcb121c60b4", "topic_url": "https://wpml.org/forums/topic/the-internal-link-of-russian-and-arabic-edition-can-not-redirect-to-the-right-page/", "text": "the internal link of Russian and Arabic edition can not redirect to the right page. You are trying to ensure that internal links on the Russian and Arabic editions of your site redirect to the correct language-specific pages. However, the internal link in the short description of the Russian and Arabic editions redirects to the English page instead of the intended Russian or Arabic category page.", "solution": "The issue arises because the link is a relative one that lacks the necessary language folder code. To resolve this, you should manually add the language path to the translated link. For example, if you are working on the Russian version, you should modify the link to include the /ru/ path, like so: /ru/product-category/%d0%bf%d0%bb%d0%b5%d1%81%d0%b5%d0%bd%d1%8c/ ."}
{"case_id": "a578d9ae15eecb25", "topic_url": "https://wpml.org/forums/topic/the-credit-card-form-of-checkout-page-do-not-show-correctly/#post-17530434", "text": "The client is experiencing an issue where the credit card form on the checkout page does not appear correctly in the default language, although it appears fine in the sublanguage. The client questioned if WPML might be conflicting with any plugins.", "solution": "We have investigated the issue and determined that it is not related to WPML. It seems to be linked to the server environment or the payment methods used. We recommend the following steps to diagnose the issue further: 1. Temporarily deactivate all WPML plugins. 2. Ensure that your WordPress site language is set to English. 3. Visit the checkout page (/checkout/). 4. Check if the credit card form issue persists. If the form appears correctly with WPML plugins disabled, it should also work correctly once you reactivate WPML."}
{"case_id": "f54fcff2edccffd4", "topic_url": "https://wpml.org/forums/topic/issue-with-woocommerce-product-bundles/", "text": "Issue with WooCommerce Product Bundles If you're experiencing issues with translating a WooCommerce Bundled product where the translated product is missing settings like layout and pricing options, this might be due to the default language settings for certain variables.", "solution": "We recommend checking the settings for the min and max bundle size variables in your WPML settings. Here's how you can do it: 1. Navigate to WPML > Settings > Custom Fields Translations , and click on Show System Fields . 2. Set both _wcpb_max_qty_limit and _wcpb_max_qty_limit to Copy . This action will ensure that future translations copy over the value correctly."}
{"case_id": "887652cd2b4b8e8d", "topic_url": "https://wpml.org/forums/topic/wpml-import-export-10/", "text": "WPML Import/Export support ticket You need help transferring all your translations from AIT to WPML.", "solution": "You can follow the progress here: WPML Import/Export support ticket ."}
{"case_id": "7ad0f237547dc75f", "topic_url": "https://wpml.org/forums/topic/product-translation-sync/", "text": "Product translation sync You are trying to translate WooCommerce products using WPML and want the translated versions to automatically update when modifications are made to the original products, such as price changes or variations. However, the changes to the original products are not automatically syncing to the translated versions.", "solution": "1. Navigate to WPML → Taxonomy Translation , select the attribute you want to synchronize, and run the 'Synchronize attributes and update product variations' option. 2. Go to WooCommerce → WPML Multilingual & Multicurrency for WooCommerce → Status , click on the Troubleshooting link at the bottom, and execute the appropriate troubleshooting options. Remember to back up your database before making any changes. Regarding your query about SKUs, the original product and its translations share the same SKU. This is because WPML treats them as language variants of the same item, not as separate products. Therefore, you should not encounter issues with duplicate SKUs when using WPML."}
{"case_id": "cbdc766998b9137c", "topic_url": "https://wpml.org/forums/topic/ate-translations-not-applied-status/#post-17572228", "text": "You are trying to create new translations or update existing translations of pages and products via WPML Advanced Translation Editor (ATE). After completing the translation in ATE, the translation should automatically apply, and the status should change to 'Complete' in WPML Translation Management. However, the translated page/product is not created or updated in the target language, and the status changes to 'assigned to local translator'. The translation is saved in ATE but is not applied to the WordPress site, and no translated page is visible on the site frontend.", "solution": "The issue was due to a mismatch between the website id on your site for the Advanced Translator Editor and the one in our system, likely caused by a problem during migration. We have manually corrected this mismatch, and now the translations should complete as expected."}
{"case_id": "028bce9c71d5df88", "topic_url": "https://wpml.org/forums/topic/fatal-error-when-saving-languages/#post-17679611", "text": "If you're experiencing a fatal error stating 'Cannot use object of type stdClass as array' in sitepress-multilingual-cms/classes/localization/class-wpml-download-localization.php, it might be due to a conflict with Duplicator Pro plugin. This occurs because the translations_api filter should return an array, but Duplicator Pro sometimes returns an object, causing WPML to treat it incorrectly.", "solution": "We recommend deactivating Duplicator Pro to see if the issue resolves. If it does, you can apply a temporary fix by modifying the code in wp-content/plugins/duplicator-pro/src/Utils/Translations.php. Replace the problematic line with the following code: return $this->getTranslations($args['slug'], $this->apiUrl); With: $translations = $this->getTranslations($args['slug'], $this->apiUrl);<br />// Ensure we return an array, not an object (WordPress expects array)<br />if (is_object($translations) && isset($translations->{ $args['slug'] })) {<br /> return $translations->{ $args['slug'] };<br />}<br />return is_array($translations) ? $translations : []; We also suggest reporting this issue to Duplicator Pro support for a permanent fix."}
{"case_id": "3e0b5c590959d655", "topic_url": "https://wpml.org/forums/topic/only-an-english-untranslated-site/", "text": "only an english untranslated site The client wants to convert their bilingual Dutch-English website to be English-only, while considering keeping the Dutch version as the main language initially.", "solution": "If you're aiming to have your site in English only, you don't need to transfer content from English to Dutch. Instead, follow these steps: 1. Navigate to WPML -> Languages. 2. Use the 'Change default language' button to set English as the default language. 3. In the same WPML -> Languages section, click on the option to activate/deactivate languages and then deactivate Dutch. 4. Now, your site will be solely in English. Optionally, you can delete the Dutch content after disabling it, as described in this guide: How to completely remove a language from your site ."}
{"case_id": "e81ea6ca4654f999", "topic_url": "https://wpml.org/forums/topic/string-translation-doesnt-translate-on-the-front-end/", "text": "String Translation doesn’t translate on the front end The client was unable to see the translated strings on the front end of their website, despite having added the necessary translations under the correct domain and word. The issue was observed with strings within a shortcode.", "solution": "We recommended the client to ensure that the strings were correctly registered and translated in WPML. We provided a revised version of the shortcode function to correctly apply translations using the __(...) and apply_filters('wpml_translate_single_string', ...) functions. Here is the revised code: function render_homeblock() {<br /> ob_start();<br /> ?><br /> <div class=\"just-center row\"><br /> <div class=\"col-xs-12 col-sm-6 col-md-6 col-lg-4\"><br /> <div class=\"content_box boxes blue res_val\"><br /> <div class=\"background_img\" style=\"background-image:url('/wp-content/uploads/2021/09/residential-valuation_min.webp');\"></div><br /> <div class=\"link_wrap overlay_wrap\"><br /> <h3><?php echo __('Residential Valuation', 'cm_text'); ?></h3><br /> <span class=\"abs_wrap\"><br /> <a href=\"<?php echo __('/services', 'cm_text'); ?>/residential-property-valuation\" title=\"<?php echo __('Residential Valuation', 'cm_text'); ?>\"><?php echo __('Learn More', 'cm_text'); ?></a><br /> </span><br /> </div><br /> </div><br /> </div><br /> </div><br /> <?php<br /> return ob_get_clean();<br />}<br />add_shortcode('display_homeblocks', 'render_homeblock'); We tested this solution on a sandbox site, and it worked correctly."}
{"case_id": "c07ad020d68bf5b9", "topic_url": "https://wpml.org/forums/topic/500-internal-server-error-when-accessing-translated-pages/?paged=2#post-17513689", "text": "The client is experiencing a 500 Internal Server Error when accessing translated versions of their website in languages other than the main language (Spanish). This issue occurs specifically with URLs like /nl/, /fr/, /de/, etc. The error does not affect the default Spanish pages. The problem seems to be related to the Homelengo Real Estate theme, which triggers a PHP fatal error when WPML is active or when visiting pages in secondary languages. Additionally, there are issues with internal redirects and REST endpoints used by Contact Form 7.", "solution": "We recommend the following steps to troubleshoot and potentially resolve the issue: 1. Contact the hosting provider to check the server error logs for more specific details about the error. 2. Disable the Homelengo Real Estate theme temporarily to see if the issue persists with a default theme. 3. Deactivate and reactivate WPML and Contact Form 7 to check if the issue is specifically related to these plugins. 4. Review and possibly adjust the .htaccess file to normalize /wp-json with language prefixes. 5. Flush permalinks and caches to ensure no stale settings are causing the issue. 6. If the problem continues, provide the debug log to the WPML support team for further analysis. You can find instructions on how to provide this information here: https://wpml.org/faq/provide-debug-information-faster-support/ If these steps do not resolve the issue or if the solution seems outdated or irrelevant to your specific case,"}
{"case_id": "5fe09a6e7cfc4cf2", "topic_url": "https://wpml.org/forums/topic/translating-search-filter-fields/?paged=1", "text": "1 The client was experiencing issues with the Advanced Translation Editor (ATE) in WPML, specifically receiving errors such as 'Unable to retrieve job details' and 'Jobs could not be loaded' while trying to translate Search & Filter fields using ACF and Elementor Pro.", "solution": "1. Ensure all WPML plugins are updated to the latest versions by navigating to Plugins → Add New → Commercial tab. 2. Clear all caches, including WPML's cache, by going to WPML → Support → Troubleshooting and using the provided tools. 3. Verify the ATE API connection under WPML → Settings → Translation Editor . 4. Use WPML's troubleshooting tools to remove ghost entries and fix database collation issues. 5. Check Elementor widgets for excessively long strings or complex content that might be causing issues. 6. Install and activate the ACF Multilingual plugin, set ACF field translation preferences, and update original posts/pages to trigger new translation settings. 7. If issues persist, manually inspect WPML job queues and database for stalled or corrupted translation jobs. 8. Review for known WPML/ACFML conflicts, especially with Elementor, and check logs for related errors. If these steps do not resolve the issue or if the solution seems outdated or irrelevant to your specific case,"}
{"case_id": "a4a1be38f6d8ece3", "topic_url": "https://wpml.org/forums/topic/missing-custom-siteorigin-widgets-after-updating-wpml-v4-8-4-string-translation-v3-4-1/?paged=2", "text": "2 The client is experiencing issues with custom widgets turning into 'Missing widget' entries after saving a page in SiteOrigin Page Builder, following updates to WPML v4.8.4 and String Translation v3.4.1. Additionally, there is a 404 error on the pagination of a custom post type archive, which temporarily resolves upon re-saving the ACF custom post type but reappears later.", "solution": "We have determined that the issue with the widgets is not directly caused by WPML or String Translation, but rather by how the custom widgets are loaded and registered. Ensure that all custom widgets are registered using the standard widgets_init action and confirm that widget IDs and class names exactly match those saved in SiteOrigin. Also, check for PHP 8.3 compatibility as the plugin might use outdated code. For the 'Missing widget' issue, disabling the 'Automatically detect best options for translating image texts' setting under WPML → Settings → Media Translation might resolve the issue. This is because WPML's media duplication process could be stripping necessary backslashes from the widget's data when saved in a secondary language. If problems persist, it's recommended to use wp_slash() when saving data to ensure backslashes are preserved. If these solutions do not resolve the issues or if new problems arise, we recommend opening a new support ticket. Additionally, it's advisable to check related known issues at https://wpml.org/known-issues/ , verify the version of the permanent fix, and confirm that you have installed the latest versions of themes and plugins. For further assistance, please visit our support forum at WPML Support Forum ."}
{"case_id": "b1238ab430e9aac2", "topic_url": "https://wpml.org/forums/topic/different-sticky-posts-in-different-langauges/", "text": "different sticky posts in different langauges The client is experiencing issues with managing sticky posts in different languages using WPML and another plugin to enable sticky post behavior for custom post types. Despite disabling 'Synchronize sticky flag' in WPML, the query still returns translations of sticky posts that are not selected as sticky in the current language.", "solution": "We recommend filtering the sticky post IDs to include only those in the current language before running the query. Here is a step-by-step approach: $current_lang = apply_filters( 'wpml_current_language', null );<br />$stickies = array_filter(<br /> get_option( 'sticky_posts', [] ),<br /> fn( $id ) => apply_filters( 'wpml_post_language_details', null, $id )['language_code'] === $current_lang<br />);<br /><br />$args = [<br /> 'post_type' => ['post', 'events'],<br /> 'post__in' => $stickies ?: [0],<br /> 'suppress_filters' => false,<br />];<br /><br />$query = new WP_Query( $args );<br /> This solution ensures that only sticky posts from the active language are queried, working regardless of fallback settings and without needing to change the post type translation mode."}
{"case_id": "64b85d0c9b7a146d", "topic_url": "https://wpml.org/forums/topic/there-is-an-issue-with-the-endpoint-slugs-of-order-received-in-woocommerce/", "text": "There is an issue with the endpoint slugs of order-received in Woocommerce The client is experiencing an issue where the WooCommerce 'order-received' page only displays correctly in the default language. In other languages, it shows a single sentence instead of the translated thank you page.", "solution": "We have resolved this issue, and it will be included in the upcoming WCML v5.5.3.1 release. We recommend updating all WPML plugins once the update is available to ensure that the 'order-received' endpoint functions correctly in all languages. Before proceeding with the update, please ensure to take a full site backup."}
{"case_id": "ea8ad97cc0fb15da", "topic_url": "https://wpml.org/forums/topic/contact-form-not-working-after-update-translation-issue/#post-17558334", "text": "After updating the site, the contact form stopped working, and the English version of the contact page displayed Swedish content. Additionally, a 503 Service Unavailable error appeared, suggesting a server-related issue.", "solution": "First, we recommend checking if the contact form works when temporarily deactivating the WPML plugins. If the issue persists, it might be related to caching or a security plugin blocking the request. Furthermore, ensure you are using the WPML Multilingual for CF7 plugin to maintain compatibility between WPML and Contact Form 7. You can find more information and installation instructions here: Using Contact Form 7 with WPML . Always back up your database before making any changes."}
{"case_id": "d3dde7f7c0a4b752", "topic_url": "https://wpml.org/forums/topic/lone-existing-site-and-then-remove-all-other-languages-from-cloned-site-except-for-one-language/?paged=1", "text": "1 The client wants to clone an existing site and then remove all languages except for one from the cloned site. They encountered issues after deactivating and deleting the WPML plugin, including errors during deletion, issues with the shop page not loading, incorrect main menu items, and needing to reset the homepage and shop page settings.", "solution": "We recommend the following steps to address the issues encountered: 1. Before starting to delete content after changing the source language, navigate to WPML → Settings and ensure to uncheck the options: - When deleting a post, delete translations as well - When deleting a taxonomy (category, tag, or custom), delete translations as well These settings prevent the deletion of translations when the main content is deleted, which can help avoid some of the issues experienced."}
{"case_id": "c356850fa944022a", "topic_url": "https://wpml.org/forums/topic/product_type-field-was-set-incorrectly-for-some-product-translations-2/?paged=2#post-17487156", "text": "You are experiencing issues with product translations on your WooCommerce site using WPML, specifically with incorrect settings for the product_type field and non-equivalent products in different languages.", "solution": "First, ensure that the product_type and product_visibility fields are set to 'Not translatable' in WPML → Settings. This adjustment prevents these fields from being incorrectly translated. Next, to make all products visible, disable the 'Hide out of stock items from the catalog' option in WooCommerce → Settings → Products → Inventory."}
{"case_id": "fa7b2e71e13a8bea", "topic_url": "https://wpml.org/forums/topic/migrated-site-and-now-seeing-an-error/?paged=2", "text": "2 After migrating a development site to production, the client encountered an error message stating 'Site Moved or Copied - Action Required.' This occurred because the WPML plugin was not properly migrated using WPML's migration feature.", "solution": "We checked the site and confirmed there were no critical errors. The error banner was due to an outdated version of WPML from before version 4.4, which was not compatible with the newer 4.8.2 version. To resolve this, we: 1. Installed the last 4.4.X version of WPML along with the latest version of the Translation Management plugin. 2. Ran the \"move\" option in the WPML settings. 3. Updated WPML to the latest version to ensure compatibility and prevent similar issues. We recommend following these steps for updating WPML in the future to avoid version compatibility issues: https://wpml.org/faq/updating-wpml-manually/"}
{"case_id": "faaf1397b5c8dc6e", "topic_url": "https://wpml.org/forums/topic/account-page-not-translated/?paged=2", "text": "2 The client reported that the 'My Account' page was not translating properly into Dutch and Spanish, remaining in English despite other pages being correctly translated. Additionally, various WooCommerce interface strings on Dutch shop and category pages were not translating, and a specific MailPoet checkbox text on the checkout page was not displaying its Dutch translation.", "solution": "We identified that the issue was due to hardcoded links in the HTML that did not include the necessary language prefix after the default site language was changed. These links needed manual correction. For the 'Add to Wishlist' string, it was incorrectly set as Dutch in WPML, and we changed its source language to English before translating it to Dutch. Regarding the MailPoet checkbox text, it was determined that MailPoet is not fully compatible with WPML, which was causing the translation issue. We recommended checking for alternative solutions or methods for this specific string."}
{"case_id": "9a58f485b87c597e", "topic_url": "https://wpml.org/forums/topic/translation-is-not-shown-correct/", "text": "Translation is not shown correct After updating WPML, unexpected paragraph breaks appeared in the translated version of a page, while the original language displayed correctly.", "solution": "First, ensure you have the latest WPML version by navigating to Plugins -> Add new -> Commercial and clicking the Check for Updates button. You should update to WPML 4.8.3 if not already done. Next, update the original page and resend it for translation. You might need to cancel or delete the previous translation job. This process resolved similar issues in our tests."}
{"case_id": "3f7a339240e28cdc", "topic_url": "https://wpml.org/forums/topic/filter-untranslated-products-in-secondary-language/#post-17530776", "text": "You are trying to display untranslated products on the English version of your site using WPML, but the widget attribute filter does not work for displaying these products in the secondary language.", "solution": "This issue may occur because translated attributes are not associated with products in the secondary language that are not translated. This can lead to empty filter counts or the filter not appearing at all. We recommend duplicating the products into the secondary language or removing the attribute translations."}
{"case_id": "e084eabd204db4a1", "topic_url": "https://wpml.org/forums/topic/i-need-to-understand-if-we-can-implement-multi-country-with-multilingual-suport-and-more/#post-17591192", "text": "The client is developing a site for multiple countries in Europe and the Middle East and is considering using WPML for a multicountry and multilingual setup. They asked if they could create a multicountry site with custom languages like /en-fr for English France and /fr-fr for French France, enable auto-translate for all languages, understand how auto-translate works, and the best SEO strategy for multicountry and multilingual setups.", "solution": "We explained that language codes are based on the ISO standard, which is language-based, not region or country-based. For example, 'en' stands for English and 'fr' for French, while 'en-US' and 'en-GB' represent American and British English, respectively. Custom codes like 'en-FR' (English as spoken in France) do not exist in standard usage and would not be recognized by browsers or search engines. Therefore, using such codes would be ineffective. For geotargeting, which is different from language settings, we recommended using WPML in conjunction with a geotargeting plugin. This setup allows the site to display languages based on the visitor's IP location. We provided a link to compatible geotargeting plugins: https://wpml.org/plugin-functionality/geotargeting/ Regarding the structure of the websites (whether to build a multi-site or multiple individual sites), we noted that this decision depends on the client's business strategy and goes beyond what we can advise on as support."}
{"case_id": "e500ceab9bb637b2", "topic_url": "https://wpml.org/forums/topic/different-sticky-posts-in-different-langauges/#post-17506724", "text": "The client is experiencing issues with managing sticky posts in different languages using WPML and another plugin to enable sticky post behavior for custom post types. Despite disabling 'Synchronize sticky flag' in WPML, the query still returns translations of sticky posts that are not selected as sticky in the current language.", "solution": "We recommend filtering the sticky post IDs to include only those in the current language before running the query. Here is a step-by-step approach: $current_lang = apply_filters( 'wpml_current_language', null );<br />$stickies = array_filter(<br /> get_option( 'sticky_posts', [] ),<br /> fn( $id ) => apply_filters( 'wpml_post_language_details', null, $id )['language_code'] === $current_lang<br />);<br /><br />$args = [<br /> 'post_type' => ['post', 'events'],<br /> 'post__in' => $stickies ?: [0],<br /> 'suppress_filters' => false,<br />];<br /><br />$query = new WP_Query( $args );<br /> This solution ensures that only sticky posts from the active language are queried, working regardless of fallback settings and without needing to change the post type translation mode."}
{"case_id": "f9ca30ec06d41b4f", "topic_url": "https://wpml.org/forums/topic/wpml-is-breaking-my-website/#post-17630982", "text": "The client is experiencing errors on both the front end and backend of their website when WPML plugins are active. Even after renaming the WPML plugins via FTP, the issues are not fully resolved, and the client is able to log in to the backend again. The client inquires if there is an issue with the most recent version of WPML and PHP 8.4.13.", "solution": "We resolved the problem by adjusting the 'Sidebar position' setting on the translated page. Originally, it was set to 'Right' on the translation, whereas it was 'Disabled' on the original page. We updated this setting using WPBakery Page Builder on the Dutch version of the page and ensured it was consistent with the original. Additionally, we enabled the 'Show ‘Multilingual Content Setup’ meta box on post edit screen' option in WPML → Settings → Custom Fields Translation. This setting helps display the custom fields on the page. We also set the relevant custom fields to 'Copy' to ensure that settings like Sidebar Position will automatically sync to translated pages in future translations."}
{"case_id": "5b15c6dcdcd21e0d", "topic_url": "https://wpml.org/forums/topic/wpml-editor-misses-translations/?paged=2#post-17552507", "text": "The client was experiencing issues with their WPML editor where translations were not displaying correctly. They expected to see a column with original language texts and another with translations, but instead, some items showed translations while most displayed the original text. The client had previously set up a staging site and migrated the translation memory, which was treated as a separate entity, causing the main site to lose its translations.", "solution": "We advised the client that during the staging site setup, they should have selected the option 'I logged in from another domain' to ensure the staging site was connected to the same automatic translation account as the live site. This would have allowed the sites to share the translation memory and avoid re-translating content that was already translated. We provided documentation on how to properly connect websites and share their translation memory: https://wpml.org/documentation/automatic-translation/automatic-translation-subscription-for-multiple-sites/ . If the client confirms, we can also manually copy the memory back to the live site from our side."}
